{
  "url:root": "https://classe.dev",
  "url:courses": "https://classe.dev/cursos",
  "url:course": "https://classe.dev{course}",
  "url:contact": "https://classe.dev/contacto",
  "url:logo": "https://classe.dev/images/logo.png",
  "url:og-1200x1200": "https://classe.dev/images/og/og-1200x1200.png",
  "url:og-921x518": "https://classe.dev/images/og/og-921x518.png",
  "url:og-400x400": "https://classe.dev/images/og/og-400x400.png",
  "url:og-256x256": "https://classe.dev/images/og/og-256x256.png",
  "url:favicon-144": "https://classe.dev/favicon-144.png",

  "info-head-home:title": "Classe | Formación para desarrolladores por desarrolladores",
  "info-head-home:description": "Cursos de programación presenciales y online pensados para profesionales -tanto de forma particular como para empresas- e impartidos por el equipo de Redradix.",

  "info-head-courses:title": "Nuestros cursos | Classe",
  "info-head-courses:description": "Actualmente realizamos cursos para profundizar al máximo en JavaScript, Maquetación (UI Development), Desarrollo Front-end y Back-end.",

  "info-head-course:title": "Curso de {course} | Classe",

  "info-head-contact:title": "Contacto | Classe",
  "info-head-contact:description": "Contacta con nosotros. Calatrava, 27 (en La Latina, Madrid) info@classe.dev",

  "info-head-legal-terms:title": "Aviso legal y política de privacidad | Classe",
  "info-head-legal-terms:description": "Description. El titular de esta página web es Redradix S.L. Cualquier dato personal facilitado a través de ella será tratado de acuerdo a esta política de privacidad.",

  "info-head-cookies-policy:title": "Cookies | Classe",
  "info-head-cookies-policy:description": " Utilizamos cookies analíticas para recopilar información anónima sobre cómo interactúas con nuestro sitio web.",

  "schema-educational-organization:name": "Classe",
  "schema-educational-organization:lang": "es",
  "schema-educational-organization:lang-upper-case": "ES",

  "schema-website:headline": "Classe, programación para profesionales por profesionales",
  "schema-website:name": "Classe, programación para profesionales por profesionales",
  "schema-website:description": "Cursos de programación presenciales y online pensados para profesionales -tanto de forma particular como para empresas- e impartidos por el equipo de Redradix.",

  "schema-contact-page:name": "Classe",
  "schema-contact-page:headline": "Classe, cursos de programación y producto digital por y para desarrolladores.",
  "schema-contact-page:description": "Formación presencial y en remoto  pensada por y para profesionales -tanto de forma particular como para empresas- e impartidos por el equipo de Redradix.",
  "schema-contact-page:main-entity-of-page-name": "Contacto",
  "schema-contact-page:email": "info@clase.dev",
  "schema-contact-page:address": "Calle Calatrava, 27",
  "schema-contact-page:postal-code": "28005",
  "schema-contact-page:locality": "Madrid",
  "schema-contact-page:country": "España",
  "schema-contact-page:latitude": "40.41097267132999",
  "schema-contact-page:longitude": "-3.712211732196113",

  "schema-course:price-currency": "EUR",

  "schema-educational-event:location-name": "Classe, programación para profesionales por profesionales",
  "schema-educational-event:organitation-name": "Classe, programación para profesionales por profesionales",

  "schema-breadcrumb-list:home-name": "Classe, programación para profesionales por profesionales",
  "schema-breadcrumb-list:courses-name": "Cursos",
  "schema-breadcrumb-list:contact-name": "Contacto",
  "schema-breadcrumb-list:legal-terms-name": "Términos legales",
  "schema-breadcrumb-list:cookies-policy-name": "Cookies",

  "general:conditions-check": "Acepto los términos y condiciones",
  "general:go-to-home": "Ir a la home",
  "general:newsletter-check": "Suscribirme a la newsletter",
  "general:placeholder": "Introduce tu email",
  "general:name-lastname-placeholder": "Nombre Apellido",
  "general:send": "Enviar",

  "menu:claim": "CLASS(E) no bullshit",
  "menu:claimSmall": "CLASS(E)",
  "menu:courses": "Cursos",
  "menu:contact": "Contacta",
  "menu:open": "Menu",
  "menu:close": "Cerrar",

  "loader:text": "<line>Class[e]</line>",

  "home:title": "Cursos de programación y producto digital por y para desarrolladores",

  "manifest:header": "Manifiesto",
  "manifest:claim": "<line>Más de 10 años</line> <lineTab>formando</lineTab> <lineTabAriaHidden>(pro)fesionales</lineTabAriaHidden> <screenReadOnly>profesionales</screenReadOnly>",
  "manifest:title": "<line>Aquí</line> <lineTab>nuestro</lineTab> <line>manifiesto</line>",
  "manifest:description": "Classe es Redradix y Redradix es Classe. La una sin la otra no tienen sentido. Una porque si nuestros cursos y contenidos valen la pena es porque los imparte el equipo de Redradix, curtido a diario en mil batallas y proyectos reales. La otra, porque una de las cosas que hacen que llevemos 10 años al pie del cañón es nuestro carácter didáctico. Ya sea en charlas, talleres, katas o conversaciones de Slack, siempre compartimos todo lo que vamos aprendiendo. Para que nos conozcas más: nos alejamos de lo que nos suene a bullshit. Y no engañamos a nadie. \n Classe es la formación que nos habría gustado tener a nosotros en nuestros primeros años trabajando en productos digitales. Una formación complementaria para todos los que se dedican al desarrollo y diseño digital, que no es teoría ni se queda en ella. Una formación que se basa en el día a día de los que la imparten -todos profesionales en activo- y en todo lo que han ido aprendiendo para mejorar en sus proyectos y sus carreras. Una formación que comparte las bases que hacen que contemos con auténticos cracks del desarrollo en nuestro equipo. \n Classe quiere compartir todo esto en cursos abiertos de acceso libre para gente que ya sabe de qué va esto de programar y hacer producto digital. Y también con cursos que se adaptan a las empresas para que mejoren las habilidades de sus equipos y dar así el salto que necesitan en sus proyectos. \n Classe va de aprender para poder ponerlo en práctica después y de ser mejor profesional, incluso si crees que ya lo sabes todo. ",

  "courses:header": "Cursos",
  "courses:claim": "<line>Formación</line> <line>para</line> <lineTab>profesionales</lineTab> <line>por</line> <lineTab>profesionales</lineTab>",
  "courses:description": "Sí. Sabes programar. Pero todavía no eres un experto. Y este es el impulso que tu carrera necesita para alcanzar el trabajo que te mereces.",
  "courses:button": "Pregúntanos",
  "courses:closing": "Cierre",

  "course:button": "Inscribirme",
  "course:need-more-details": "¿Necesitas más detalles?",
  "course:contact-us": "Contáctanos",
  "course:index-title": "Índice",

  "course:pdf-title": "Dosier del curso",
  "course:pdf-button": "Descargar",

  "course:js-title": "Desarrollo",
  "course:js-alt-image": "Un hombre de perfil trabajando con su ordenador",
  "course:js-schema-description": "El mejor curso para aprender JavaScript en profundidad. Los cimientos sobre los que apoyar conocimientos futuros.",
  "course:js-description": "Brendan Eich escribió la primera versión de JS en 10 días. 25 años después sigue siendo una parte clave dentro y fuera de Internet. Este curso va más allá de las nociones básicas y empieza donde otros acaban. Profundizaremos en conceptos de programación avanzados desde el punto de vista de este lenguaje y hurgaremos en las tripas de JS para conquistarlo y entender sus pros y sus contras.",
  "course:js-01-title": "<line>Tipos</line> <line>de</line> <line>datos</line>",
  "course:js-01-description": "Empezando por Arrays y Mapas, pasando por Sets, Símbolos hasta llegar a Proxies y Objetos. Serás capaz de explotar estas estructuras como no imaginabas que fuera posible.",
  "course:js-02-title": "<line>Orientación</line> <line>a</line> <line>objetos</line>",
  "course:js-02-description": "JavaScript es un lenguaje orientado a prototipos, así que conocer la trampa que esconde para implementar OO te ayudará a ver sus posibilidades y limitaciones.",
  "course:js-03-title": "<lineAriaHidden>Programa</lineAriaHidden> <lineAriaHidden>ción</lineAriaHidden><screenReadOnly>Programación</screenReadOnly> <line>funcional</line>",
  "course:js-03-description": "Pon un curry en tu vida y déjate seducir por las posibilidades de la programación funcional y lo mucho que puede aportar a tu base de código en términos de simplicidad a tu base de código.",
  "course:js-04-title": "<lineAriaHidden>Programa</lineAriaHidden> <lineAriaHidden>ción</lineAriaHidden> <lineAriaHidden>asíncrona</lineAriaHidden><screenReadOnly>Programación asíncrona</screenReadOnly>",
  "course:js-04-description": "Está por todas partes y es necesario entender todas sus implicaciones sin que te explote la cabeza. De callback hell a generadores, pasando por la creación de una implementación de promesas y async/await.",
  "course:js-05-title": "<line>Módulos</line><line> op</line><line>cionales</line>",
  "course:js-05-description": "Podemos complementar el curso con distintos módulos de 4 horas sobre lenguaje tipado con typescript, estrategias de testing, graphQL y las mejoras propuestas para ECMAScript.",
  "course:js-learn": "<lineAriaHidden>Con este/</lineAriaHidden><screenReadOnly>Con este</screenReadOnly> <line>curso</line> <line>aprenderás:</line>",
  "course:js-learn-description": "Básicamente: JavaScript en profundidad. Los cimientos sobre los que apoyar conocimientos futuros. Verás que se puede pasar de Angular a React en horas si las bases son sólidas. No solo eso, tus compañeros te agradecerán que tu código sea robusto, escalable y, sobre todo, legible.",
  "course:js-objectives": "<lineAriaHidden>Es para/</lineAriaHidden><screenReadOnly>¿Es para</screenReadOnly> <line>mí?</line>",
  "course:js-objetives-description": "Este es un curso avanzado para profesionales que han trabajado en desarrollo web al menos durante un año. Está centrado en learn by doing con ejercicios divertidos para hacer y corregir en vivo. Live programming al poder!",

  "course:ui-dev-title": "Maqueta",
  "course:ui-dev-alt-image": "Un hombre de perfil trabajando en su portátil",
  "course:ui-dev-meta-description": "El mejor curso para profundizar en la maquetación para crear plataformas accesibles, dinámicas, escalables y usables.",
  "course:ui-dev-description": "Creemos en la división de responsabilidades y consideramos la maquetación como una disciplina en sí misma con un alto grado de especialización. Así lo hemos hecho en Redradix desde hace mas de 10 años y hemos aprendido mucho por el camino. En este curso profundizaremos en la maquetación para crear plataformas accesibles, dinámicas, escalables y usables. Atacando conceptos como arquitectura CSS, o analizando cuándo usar diferentes layouts, navegaremos a través de ejemplos cotidianos que te pondrán contra las cuerdas. No es un curso de iniciación. ¿Sabes HTML y CSS? En este curso te lo vas a replantear.",
  "course:ui-dev-01-title": "<line>Estructura</line> <line>HTML</line>",
  "course:ui-dev-01-description": "Etiquetas, imágenes, tabulación de datos, buenas prácticas sobre enlaces, validación de formularios, carga de archivos, microformatos o accesibilidad son algunos de los temas de los que hablaremos desde una perspectiva avanzada.",
  "course:ui-dev-02-title": "<line>Estructura</line> <line>CSS</line>",
  "course:ui-dev-02-description": "Con una aproximación similar a la anterior, veremos conceptos complejos como la carga de archivos, el modelo de caja, selectores avanzados, pseudoclases y pseudoelementos, unidades CSS, RWD o tipografías, entre otros.",
  "course:ui-dev-03-title": "<line>CSS</line> <line>Avanzado</line>",
  "course:ui-dev-03-description": "Una vez entendidas todas las posibilidades que nos da el lenguaje, profundizaremos en conceptos avanzados como arquitecturas CSS, transformaciones, transiciones y animaciones, filtros y modos de fusión o variables CSS, eso por poner algunos ejemplos.",
  "course:ui-dev-04-title": "<line>Flexbox y </line><line>CSS Grid</line>",
  "course:ui-dev-04-description": "Dada la relevancia que han cogido en los últimos tiempos, tanto Flexbox como Grid merecen un reservado donde ver todos sus entresijos y cómo pueden simplificar nuestras vidas.",
  "course:ui-dev-05-title": "<line>Ecosistema</line>",
  "course:ui-dev-05-description": "Si quieres introducirte en conceptos de maquetación avanzada es esencial conocer las herramientas de las que dispones, desde las posibilidades del editor hasta los trucos ocultos del navegador y la consola. Magia negra.",
  "course:ui-dev-learn": "<lineAriaHidden>Con este/</lineAriaHidden><screenReadOnly>Con este</screenReadOnly> <line>curso</line> <line>aprenderás:</line>",
  "course:ui-dev-learn-description": "Estamos hartos de ver comportamientos responsive defectuosos, transiciones que no fluyen o scrolls que dan ganas de tirar el ordenador por la ventana. Basta ya! Este curso te ayudará a crear interfaces que respeten los estándares y, sobre todo, a los usuarios.",
  "course:ui-dev-objectives": "<lineAriaHidden>Es para/</lineAriaHidden><screenReadOnly>¿Es para</screenReadOnly> <line>mí?</line>",
  "course:ui-dev-objetives-description": "Este es un curso avanzado para profesionales que han trabajado en desarrollo web al menos durante un año. Está centrado en learn by doing con ejercicios divertidos para hacer y corregir en vivo. Live programming al poder!",

  "course:front-react-title": "Front-end",
  "course:front-react-alt-image": "Una mujer de perfil trabajando con su portátil y un grupo de personas en el fondo desenfocadas",
  "course:front-react-schema-description": "El mejor curso para aprender no solo React, sino más importante: por qué React.",
  "course:front-react-description": "El mundo front cambia rapidamente y nosotros con él. Nos adaptamos y evolucionamos según lo hacen las necesidades del desarrollo. Abrazamos los nuevos paradigmas y ponemos en tela de juicio las tendencias. Con los años hemos aprendido a diferenciar las modas pasajeras de los patrones que ayudan a crear mejor código. Y eso es lo que queremos enseñarte. Desde exprimir las APIs del navegador para no depender de librerías externas hasta diseccionar React para interiorizar las implicaciones del flujo unidireccional de datos. Principios de diseño y buenas prácticas que mejoren la legibilidad de tu código hasta el punto de que volver a él sea una experiencia placentera. Para aquellos que les guste el desarrollo front y quieran profundizar en él.",
  "course:front-react-01-title": "<line>Fundame</line><line>ntos</line>",
  "course:front-react-01-description": "Es necesario tener conocimiento de las posibilidades que ofrece el navegador: APIs, protocolos de comunicación, formularios o navegación. En verdad, solo así podremos construir algo verdaderamente escalable.",
  "course:front-react-02-title": "<line>Librerías y </line><line>frameworks</line>",
  "course:front-react-02-description": "Haremos una revisión del panorama de frameworks y librerías punteras, remarcando en qué destaca cada una y cuándo conviene utilizarla.",
  "course:front-react-03-title": "<line>React</line>",
  "course:front-react-03-description": "Nos centraremos en la librería que se ha ganado el derecho a ser el referente del desarrollo front. Profundizaremos en JSX, ciclo de vida, flujo unidireccional, renderizado condicional y tocaremos temas controvertidos como sus efectos secundarios o React Suspense.",
  "course:front-react-04-title": "<line>Módulos</line> <line>opcionales</line>",
  "course:front-react-04-description": "Este curso tiene un montón de módulos opcionales con los que complementar una asignatura tan compleja como el desarrollo front. Algunos relacionados con React como ReactRouter, ReactQuery o Redux, y otros  como testing en front, webextensions o i18n.",
  "course:front-react-learn": "<lineAriaHidden>Con este/</lineAriaHidden><screenReadOnly>Con este</screenReadOnly> <line>curso</line> <line>aprenderás:</line>",
  "course:front-react-learn-description": "No solo React, sino más importante: por qué React, cómo funciona, cuándo aplicarlo, patrones y antipatrones y en qué elementos del navegador se apoya. La versatilidad de React es muy amplia, como demuestran los proyectos de nuestro a día a día en Redradix. Queremos contarte cómo lo hacemos.",
  "course:front-react-objectives": "<lineAriaHidden>Es para/</lineAriaHidden><screenReadOnly>¿Es para</screenReadOnly> <line>mí?</line>",
  "course:front-react-objetives-description": "Este es un curso avanzado para profesionales que han trabajado en desarrollo front al menos durante un año. Está centrado en learn by doing con ejercicios divertidos para hacer y corregir en vivo. Live programming al poder!",

  "course:back-node-title": "Back-end",
  "course:back-node-alt-image": "Un hombre trabajando con su ordenador mirando fijamente la pantalla",
  "course:back-node-schema-description": "El mejor curso para descubrir Node.js y poder aplicar los conocimientos desde el primer día.",
  "course:back-node-description": "El mundo front cambia rapidamente y nosotros con él. Nos adaptamos y evolucionamos según lo hacen las necesidades del desarrollo. Abrazamos los nuevos paradigmas y ponemos en tela de juicio las tendencias. Con los años hemos aprendido a diferenciar las modas pasajeras de los patrones que ayudan a crear mejor código. Y eso es lo que queremos enseñarte. Desde exprimir las APIs del navegador para no depender de librerías externas hasta diseccionar React para interiorizar las implicaciones del flujo unidireccional de datos. Principios de diseño y buenas prácticas que mejoren la legibilidad de tu código hasta el punto de que volver a él sea una experiencia placentera. Para aquellos que les guste el desarrollo front y quieran profundizar en él.",
  "course:back-node-01-title": "<line>Core</line> <line>Modules</line>",
  "course:back-node-01-description": "Es necesario tener conocimiento de las posibilidades que ofrece el navegador: APIs, protocolos de comunicación, formularios o navegación. En verdad, solo así podremos construir algo verdaderamente escalable.",
  "course:back-node-02-title": "<line>HTTP y</line> <line>HTTPS</line>",
  "course:back-node-02-description": "Desde cómo crear un servidor a cómo servir contenido a las bases de una buena API REST o el uso de proxies.",
  "course:back-node-03-title": "<line>Express</line>",
  "course:back-node-03-description": "Como framework de facto, debemos conocer sus patrones recurrentes y middlewares. También sus estrategias de autenticación, haciendo hincapié en arquitecturas por capas.",
  "course:back-node-04-title": "<line>Programación</line> <line>asíncrona</line>",
  "course:back-node-04-description": "Utilizaremos Koa como base para entender y ejercitar los conocimientos sobre promesas, async/await y generadores.",
  "course:back-node-05-title": "<line>Persistencia</line> <line>de datos</line>",
  "course:back-node-05-description": "Relacionales, documentales, clave valor y también una ligera pincelada sobre las bases de datos de grafos para entender sus pros y contras. Y, sobre todo, cuándo es bueno utilizar cada una.",
  "course:back-node-06-title": "<line>Módulos</line> <line>opcionales</line>",
  "course:back-node-06-description": "Podemos complementar con pequeños módulos de 4 horas sobre server side rendering, SMTP o, incluso, procesamiento y almacenamiento en la nube.",
  "course:back-node-learn": "<lineAriaHidden>Con este/</lineAriaHidden><screenReadOnly>Con este</screenReadOnly> <line>curso</line> <line>aprenderás:</line>",
  "course:back-node-learn-description": "El 80% de los proyectos que hacemos en Redradix tienen APIs, programación asíncrona o persistencia de datos. Queremos contarte cómo lo hacemos aplicando Node.js, para que tú puedas aplicar estos conocimientos desde el primer día, creando servicios robustos y escalables de los que estar orgulloso.",
  "course:back-node-objectives": "<lineAriaHidden>Es para/</lineAriaHidden><screenReadOnly>¿Es para </screenReadOnly> <line>mí?</line>",
  "course:back-node-objetives-description": "Este es un curso avanzado para profesionales que han trabajado en desarrollo back-end al menos durante un año. Está centrado en learn by doing con ejercicios divertidos para hacer y corregir en vivo. Live programming al poder.",

  "course:objectives-title": "Objetivos",
  "course:fundamentals": "<line>Fundame</line><line>ntos</line>",
  "course:functional-programming": "<line>Program</line><line>ación </line><line>funciona</line><line>l</line>",
  "course:object-oriented-programming": "<line>Program</line><line>ación </line><line>orientad</line><line>a a</line><line>objetos</line>",
  "course:asynchronous-programming": "<line>Program</line><line>ación</line><line>asíncro</line><line>na</line>",
  "course:promises": "<line>Promesa</line><line>s</line>",

  "course:euros": "<line>euros</line>",
  "course:hours": "<line>horas</line>",
  "course:places": "<line>plazas</line>",
  "course:practical": "<line>% práctico</line>",
  "course:students": "<line>alumnos</line> <line>inscritos</line>",
  "course:contact": "¿Echas algo en falta? Puedes combinar el temario de todos nuestros cursos para que se adapte mejor a lo que buscas",

  "custom:header": "Personaliza",
  "custom:title": "<line>Nuestros</line> <lineTabAriaHidden>cursos=</lineTabAriaHidden> <screenReadOnly>cursos</screenReadOnly> <lineTab>a tu</lineTab> <lineTab>medida</lineTab> <screenReadOnly>¿Quieres saber cómo?</screenReadOnly>",
  "custom:description": "Una misma formación, por muy buena que sea, no tiene por qué valerle a todo el mundo. Por eso, con los cursos que hacemos en Classe es posible que te hagas un bundle con lo que más se adapte a ti.\nAdemás, para las empresas el temario se adapta dependiendo de lo que necesite el equipo que va a recibir la formación.\nTambién somos flexibles con el formato, ya que todos nuestros cursos pueden ser presenciales en nuestra oficina, en la tuya -si lo que quieres es un curso para empresas- o en remoto, pero en streaming. En directo para poder sacar el máximo partido de todos los que participan en la clase. Las preguntas en vivo se responden mejor. Nuestro equipo está dispuesto a hacer de patito de goma si en algún momento te hace falta.",
  "custom:claim": "<lineTab>¿Quieres</lineTab> <line>saber</line> <line>cómo?</line>",
  "custom:button": "Ver cursos",

  "featured:header": "Curso destacado",
  "featured:title": "<lineTabAriaHidden>Progra</lineTabAriaHidden><lineTabAriaHidden>mación</lineTabAriaHidden><screenReadOnly>Programación</screenReadOnly> <line>con</line> <line>JavaScript</line>",
  "featured:button": "¿Quieres saber más? Echa un ojo al curso",

  "facts:header": "Facts",
  "facts:title": "<line>Cuando decimos no</line> <lineTab>bullshit, es no bullshit</lineTab>",
  "facts:fact1": "Un programador motivado y bien preparado puede reducir hasta 10 veces el número de errores que comete.",
  "facts:fact2": "Nuestros cursos no son bootcamps de iniciación, están enfocados a gente que programa en su día a día y quiere profundizar en la profesión.",
  "facts:fact3": "No tenemos profesores. Solo profesionales que llevan años sacando todo tipo de proyectos. Y que saben lo que realmente importa en el día a día.",
  "facts:fact4": "Los desarrolladores senior ganan, de media, 30.000€ más que los junior.",
  "facts:fact5": "Un 60% de los alumnos han encontrado un puesto de trabajo mejor remunerado a los tres meses asistir a alguno de uno de nuestros cursos.",
  "facts:fact6": "Todos los cursos se basan en JS porque creemos en la especialización y es el lenguaje que usamos nosotros.",

  "calendar:header": "Calendario",
  "calendar:title": "<line>Haz</line> <line>hueco</line> <lineTab>(en tu</lineTab> <lineTab>agenda)</lineTab>",
  "calendar:description": "Las clases se impartirán de lunes a viernes de 18:30h a 21:30h. Será en nuestras oficinas de la C/ Calatrava 27. Metro: La Latina, Puerta de Toledo o Tirso de Molina.\nTambién tenemos la opción de asistencia en remoto, o híbrida presencial+ online.",
  "calendar:no-courses": "Escríbenos para enterarte el primero. ",
  "calendar:start": "Start",
  "calendar:finish": "Finish",

  "companies:header": "Empresas",
  "companies:title": "<lineAriaHidden>#</lineAriaHidden><lineTab>Empresas</lineTab> <lineTab>que han</lineTab> <lineTab>vuelto a</lineTab> <lineTabAriaHidden>Class;e</lineTabAriaHidden><screenReadOnly>Classe</screenReadOnly> <lineAriaHidden>#</lineAriaHidden>",
  "companies:button": "¿Quieres ser una de ellas? contáctanos",

  "faqs:header": "Faq's",
  "faqs:title": "<lineAriaHidden>//Aprender es no parar</lineAriaHidden><screenReadOnly>Aprender es no parar</screenReadOnly> <lineTab>de preguntar</lineTab>",
  "faqs:faq1-title": "LLEVO POCO TIEMPO EN ESTO DEL DESARROLLO, ¿ESTE CURSO ES PARA MÍ?",
  "faqs:faq1-description": "No creemos en los años de experiencia. Creemos en la pasión por la programación. Si tienes unas bases sólidas sobre las que podamos trabajar, entonces podemos hacer magia.",
  "faqs:faq2-title": "¿COMO CONVENZO A MI EMPRESA PARA QUE ORGANICE UNO DE LOS CURSOS?",
  "faqs:faq2-description": "Dile que nos contacte. Seguro que es consciente de en qué podéis mejorar. Y nosotros podemos explicarle cómo podéis hacerlo y cómo nuestros cursos se adaptan a las necesidades de cada empresa. También podemos hablar con él del resultado: menos errores en programación, menos dolores de cabeza y una mayor productividad.",
  "faqs:faq3-title": "¿HAY BENEFICIOS PARA LAS EMPRESAS CON VUESTROS CURSOS?",
  "faqs:faq3-description": "Sí. Tenemos acuerdos con la Fundación Tripartita, así que nuestros cursos se pueden financiar a través de ellos.",
  "faqs:faq4-title": "HE VISTO QUE TODA LA FORMACIÓN UTILIZA EL LENGUAJE JS, ¿POR QUÉ?",
  "faqs:faq4-description": "En nuestros cursos vamos a hablar de buenas prácticas, de principios de diseño, patrones, etc. Todo en un sentido práctico. Y para ello tenemos que utilizar un lenguaje real, el que usamos nosotros es JS. Es un lenguaje flexible y ejemplifica muy bien los paradigmas de la programación.",
  "faqs:faq5-title": "EN MI EMPRESA TRABAJAMOS CON OTROS LENGUAJES, ¿ME OLVIDO ENTONCES DE VUESTROS CURSOS?",
  "faqs:faq5-description": "Depende. Hay mucha gente que viene de otros lenguajes y en el caso de que quieras aprender JS este es tu curso, sin dudarlo. Además, tenemos los cursos de maqueta.",
  "faqs:faq6-title": "RECIBIRÉ ALGUNA TITULACIÓN AL TERMINAR EL CURSO?",
  "faqs:faq6-description": "Te daremos un certificado no homologado. En cambio sí que te llevaras muchos aprendizajes que te ayudarán a demostrar lo que vales sobre el terreno. Y eso nos parece más importante que un certificado oficial.",
  "faqs:faq7-title": "SI HAGO ALGUNO DE LOS CURSOS, ¿PUEDO ACCEDER LUEGO A LOS MATERIALES ONLINE?",
  "faqs:faq7-description": "Mejor aún. Si quieres podrás repetir las sesiones que te interese en las siguientes ediciones. Y además podrás acceder a los repositorios. Pero el nuestro es un curso en directo porque aunque en nuestro día a día defendemos la comunicación asíncrona, no se aprende igual si no se comparte el momento con el resto de la clase. ",
  "faqs:faq8-title": "¿NECESITO ALGÚN EQUIPO O PROGRAMA ESPECIAL?",
  "faqs:faq8-description": "Todo el mundo debe utilizar su ordenador porque se trabaja más cómodamente. Nos da igual la herramienta que uses, con la que más cómodo estés. Más allá de eso, proveemos de todo, incluidas chucherías para que tu cerebro funcione si haces el curso presencial en nuestra oficina.",
  "faqs:faq9-title": "¿CUÁLES SON LAS FORMAS DE PAGO?",
  "faqs:faq9-description": "El pago se realiza mediante tarjeta bancaria. Una vez realices tu inscripción te enviaremos un enlace para poder hacerlo de forma segura. ",

  "find:header": "Encuéntranos",
  "find:title": "<lineAriaHidden>Encuéntra</lineAriaHidden><lineAriaHidden>nos en la</lineAriaHidden><screenReadOnly>Encuéntranos en la</screenReadOnly> <lineTab>Latina</lineTab> <screenReadOnly>y detrás pantalla</screenReadOnly>",
  "find:description": "Si quieres venir a nuestras oficinas, estamos en pleno centro de Madrid, en la calle Calatrava, 27, al lado del Metro de La Latina.",
  "find:description2": "INFO<ariaHidden>[at]</ariaHidden><screenReader>@</screenReader>classe.dev",
  "find:claim": "<line>Y detrás</line> <lineTab>de la</lineTab> <lineTab>pantalla</lineTab>",
  "find:aria": "Copia nuestro email en el portapapeles",

  "contact:second-title": "<line>Contacta</line> <line>con Classe</line>",
  "contact:address1": "<line>Madrid, Calatrava, 27</line> <line>[Metro La Latina]</line>",
  "contact:address2": "<lineAriaHidden>info[at]classe.dev</lineAriaHidden><screenReadOnly>info@classe.dev</screenReadOnly>",
  "contact:my-name-is": "<line>Ey! Me llamo</line>",
  "contact:interested-in": "<line>Estoy interesado en</line>",
  "contact:my-email": "<line>Y este es mi correo</line>",
  "contact:success": "Gracias! Te responderemos lo antes posible.",

  "footer:header": "Bye bye",
  "footer:title": "<line>Stay</line> <lineTab>in the</lineTab> <lineTab>know</lineTab>",
  "footer:iam": "Soy",
  "footer:company": "Empresa",
  "footer:student": "Alumno",
  "footer:social": "Social",
  "footer:contact": "Contacto",
  "footer:legal": "Legal",
  "footer:legal-terms": "Términos legales",
  "footer:legal-terms-route": "/terminos-legales/",
  "footer:cookies": "Cookies",
  "footer:cookies-route": "/cookies/",

  "error:page-not": "Page not",
  "error:found": "found",
  "error:back-to-homne": "Volver a la home",

  "konami:congrats": "¡Enhorabuena!",
  "konami:unlock-discount": "Has desbloqueado un descuento para los cursos.",
  "konami:use-it-1": "Para usarlo, deberás introducir tu nombre",
  "konami:use-it-2": "en el formulario de \"Contacta\" de la siguiente manera:",
  "konami:how-to": "%c[VIP] - tu_nombre",
  "konami:example": "Por ejemplo: %c[VIP] - Luke Skywalker",

  "cookies-layer:aria-label": "Modal política de cookies",
  "cookies-layer:title": "Política de cookies",
  "cookies-layer:description": "Esta web almacena cookies y tecnologías similares propias y de terceros en tu dispositivo. Estas cookies se utilizan únicamente con fines analíticos para recopilar información anónima sobre cómo interactúas con nuestra web. <link>Puedes saber más sobre estas cookies aquí</link>.",
  "cookies-layer:link": "Saber más",
  "cookies-layer:button-accept": "Aceptar",
  "cookies-layer:button-refuse": "Rechazar",

  "legal-terms:title": "<line>Términos</line> <lineTab>legales</lineTab>",
  "legal-terms:section01-title": "Aviso legal",
  "legal-terms:section01-sub01": "Titularidad del sitio web",
  "legal-terms:section01-sub01-block-1": "El titular de la presente página web es Redradix S.L. con CIF: B86840394 y domicilio en la Calle Calatrava, 27 de Madrid, inscrita en el Registro Mercantil de Madrid - Tomo 31.483, Folio 152, Hoja M-566718, inscripción 1ª.",
  "legal-terms:section01-sub02": "Condiciones generales de uso",
  "legal-terms:section01-sub02-block-1": "El objetivo de esta página web es facilitar información sobre los servicios de formación ofrecidos por Classe, todos los cursos ofertados y contenidos relacionados. Toda la información recogida en esta página web tiene carácter meramente informativo, pero no es vinculante.",
  "legal-terms:section01-sub02-block-2": "Redradix, como titular de la página web, se reserva además el derecho de realizar, sin aviso previo, cuantas modificaciones considere necesarias en esta página web, por lo que no garantiza ni se hace responsable de la continuidad de los contenidos.",
  "legal-terms:section02-title": "Política de privacidad",
  "legal-terms:section02-block-1": "A través de esta página web es posible que nos facilites algunos datos personales como tu nombre y el correo electrónico. Para ello deberás confirmar que aceptas estas condiciones de uso a través de la casilla de verificación.",
  "legal-terms:section02-block-2": "Todos los datos personales facilitados a través del formulario de contacto serán recopilados y tratados por Redradix S.L. con al menos una de las siguientes finalidades:",
  "legal-terms:section02-block-3": "1. Dar respuesta a las solicitudes de información acerca de Classe, sus cursos y el contenido recogido en esta página web.",
  "legal-terms:section02-block-4": "2. Mantenerte informado sobre la actualidad de Classe y futuros cursos, eventos o actividades que puedan ser de tu interés.",
  "legal-terms:section02-block-5": "3. En el caso de que contrates uno de nuestros cursos, facilitar la comunicación y poder prestar el servicio con la fluidez necesaria.",
  "legal-terms:section02-block-6": "Al facilitarnos los datos contemplados en los párrafos anteriores, das tu consentimiento expreso para tratar los mismos con las finalidades mencionadas, sin perjuicio de tu derecho a revocar o ejercer tus derechos respecto a los mismos conforme se indica en esta política. Tus datos personales serán incorporados en ficheros debidamente notificados al Registro de la Agencia Española de Protección de Datos, en cumplimiento de las obligaciones establecidas en la Ley Orgánica de Protección de Datos. Incorporarte a nuestra base de datos para hacerte llegar las informaciones recogidas anteriormente.",
  "legal-terms:section02-block-7": "Podrás solicitar la baja de nuestra base de datos en cualquier momento para dejar de recibir nuestras comunicaciones. ",
  "legal-terms:section02-block-8": "Los datos de los titulares no serán comunicados a terceros en ningún caso. Si por alguna razón fuera necesario comunicar dichos datos a terceros, el titular de los datos será informado de dicha circunstancia, con carácter previo a la comunicación, especificando las finalidades de la comunicación y el tercero a quien van a ser comunicados.",
  "legal-terms:section02-block-9": "El responsable del tratamiento de estos datos es Redradix S.L. con CIF: B86840394 y domicilio en la Calle Calatrava, 27 de Madrid, inscrita en el Registro Mercantil de Madrid - Tomo 31.483, Folio 152, Hoja M-566718, inscripción 1ª.",
  "legal-terms:section02-block-10": "Puedes ejercer tus derechos de acceso, rectificación o supresión de tus datos personales a través del siguiente correo electrónico: <mailto>info@redradix.com</mailto> o mediante escrito a Redradix, Calle Calatrava, 27 28005 Madrid.",

  "cookies-policy:title": "<line>Política de</line> <lineTab>cookies</lineTab>",
  "cookies-policy:block-1": "Nuestra página web almacena cookies y tecnologías similares propias y de terceros en el dispositivo. Estas cookies se utilizan exclusivamente con fines analíticos para recopilar información de carácter anónimo sobre la forma en que se interactúa con la web y mejorar  la experiencia de navegación para nuestros visitantes.",
  "cookies-policy:block-2": "Una cookie es un archivo de texto que se almacena en el ordenador o dispositivo móvil mediante un servidor web y tan solo ese servidor es capaz de recuperar o leer el contenido de la cookie. Por lo general estas cookies permiten al sitio web recordar preferencias de navegación y navegar de manera eficiente, o recopilar información anónima para usos estadísticos. Las cookies hacen la interacción entre el usuario y el sitio web más rápida y fácil.",
  "cookies-policy:subtitle": "¿Qué cookies utilizamos?",
  "cookies-policy:block-3": "En esta web empleamos cookies analíticas de terceros. La finalidad de estas es conocer datos estadísticos de uso de la web, como el número de usuarios o los contenidos que más se consultan. De esta manera podemos concentrar nuestros esfuerzos en mejorar nuestra web y las áreas más visitadas y hacer que el usuario encuentre más fácilmente lo que busca. La información de las visitas puede utilizarse para realizar evaluaciones y métricas siempre con datos anónimos.",
  "cookies-policy:block-4": "Como usuario, debes asegurarte de que estás conforme con ellas antes de seguir navegando. Todas nuestras cookies son analíticas y puedes rechazarlas aquí.",
  "cookies-policy:block-5": "También puedes configurar el navegador para que no acepte cookies, aunque eso puede afectar al correcto funcionamiento de la aplicación.",

  "alt-image:three-web-developers": "Tres desarrolladores web desarrollando productos digitales",
  "alt-image:programming-students-attending": "Unos estudiantes de programación atendiendo a una charla",
  "alt-image:developers-working": "Un desarrollador y una desarroladora trabajando",
  "alt-image:man-working-remotely": "Un hombre trabajando en remoto visible a través de una videollamada",
  "alt-image:hands-keyboard-mouse": "Unas manos sobre un teclado y un ratón",
  "alt-image:office-desks-computer-equipment": "Oficina con varias mesas y equipos informáticos",
  "alt-image:two-web-programmers": "Dos programadores web trabajando",

  "newsletter:placeholder": "Email",
  "newsletter:btn": "Quiero estar informad@"
}
