{
  "url:root": "https://www.classe.dev",
  "url:courses": "https://www.classe.dev/cursos",
  "url:course": "https://www.classe.dev{course}",
  "url:contact": "https://www.classe.dev/contacto",
  "url:legal-terms": "https://www.classe.dev/terminos-legales",
  "url:cookies": "https://www.classe.dev/cookies",
  "url:logo": "https://www.classe.dev/images/logo.png",
  "url:og-1200x1200": "https://www.classe.dev/images/og/og-1200x1200.png",
  "url:og-921x518": "https://www.classe.dev/images/og/og-921x518.png",
  "url:og-400x400": "https://www.classe.dev/images/og/og-400x400.png",
  "url:og-256x256": "https://www.classe.dev/images/og/og-256x256.png",
  "url:favicon-144": "https://www.classe.dev/favicon-144.png",

  "info-head-home:title": "Classe | Formación para desarrolladores por desarrolladores",
  "info-head-home:description": "Cursos de programación online pensados para profesionales -tanto de forma particular como para empresas- e impartidos por el equipo de Redradix.",

  "info-head-courses:title": "Nuestros cursos | Classe",
  "info-head-courses:description": "Actualmente realizamos cursos para profundizar al máximo en JavaScript, Maquetación (UI Development), Desarrollo Front-end y Back-end.",

  "info-head-course:title": "Curso de {course} | Classe",

  "info-head-contact:title": "Contacto | Classe",
  "info-head-contact:description": "Contacta con nosotros. Calatrava, 27 (en La Latina, Madrid) info@classe.dev",

  "info-head-legal-terms:title": "Aviso legal y política de privacidad | Classe",
  "info-head-legal-terms:description": "Descripción. El titular de esta página web es Redradix S.L. Cualquier dato personal facilitado a través de ella será tratado de acuerdo a esta política de privacidad.",

  "info-head-cookies-policy:title": "Cookies | Classe",
  "info-head-cookies-policy:description": "Utilizamos cookies analíticas para recopilar información anónima sobre cómo interactúas con nuestro sitio web.",

  "schema-educational-organization:name": "Classe",
  "schema-educational-organization:lang": "es",
  "schema-educational-organization:lang-upper-case": "ES",

  "schema-website:headline": "Classe, programación para profesionales por profesionales",
  "schema-website:name": "Classe, programación para profesionales por profesionales",
  "schema-website:description": "Cursos de programación online pensados para profesionales -tanto de forma particular como para empresas- e impartidos por el equipo de Redradix.",

  "schema-contact-page:name": "Classe",
  "schema-contact-page:headline": "Classe, cursos de programación y producto digital por y para desarrolladores.",
  "schema-contact-page:description": "Formación presencial y en remoto pensada por y para profesionales -tanto de forma particular como para empresas- e impartidos por el equipo de Redradix.",
  "schema-contact-page:main-entity-of-page-name": "Contacto",
  "schema-contact-page:email": "info@classe.dev",
  "schema-contact-page:address": "Calle Calatrava, 27",
  "schema-contact-page:postal-code": "28005",
  "schema-contact-page:locality": "Madrid",
  "schema-contact-page:country": "España",
  "schema-contact-page:latitude": "40.41097267132999",
  "schema-contact-page:longitude": "-3.712211732196113",

  "schema-course:price-currency": "EUR",

  "schema-educational-event:location-name": "Classe, programación para profesionales por profesionales",
  "schema-educational-event:organitation-name": "Classe, programación para profesionales por profesionales",

  "schema-breadcrumb-list:home-name": "Classe, programación para profesionales por profesionales",
  "schema-breadcrumb-list:courses-name": "Cursos",
  "schema-breadcrumb-list:contact-name": "Contacto",
  "schema-breadcrumb-list:legal-terms-name": "Términos legales",
  "schema-breadcrumb-list:cookies-name": "Cookies",

  "general:conditions-check": "Acepto los términos y condiciones",
  "general:conditions-anchgor": "/terminos-legales/",
  "general:go-to-home": "Ir a la home",
  "general:newsletter-check": "Suscribirme a la newsletter",
  "general:placeholder": "Introduce tu email",
  "general:name-lastname-placeholder": "Nombre Apellido",
  "general:send": "Enviar",

  "menu:claim": "CLASS(E) no bullshit",
  "menu:claimSmall": "CLASS(E)",
  "menu:courses": "Cursos",
  "menu:contact": "Contacta",
  "menu:open": "Menu",
  "menu:close": "Cerrar",

  "loader:text": "<line>Class[e]</line>",

  "home:title": "Cursos de programación y producto digital por y para desarrolladores",

  "manifest:header": "Manifiesto",
  "manifest:claim": "<line>Más de 10 años</line> <lineTab>formando</lineTab> <lineTabAriaHidden>(pro)fesionales</lineTabAriaHidden> <screenReadOnly>profesionales</screenReadOnly>",
  "manifest:title": "<line>Aquí</line> <lineTab>nuestro</lineTab> <line>manifiesto</line>",
  "manifest:description": "Classe es Redradix y Redradix es Classe. La una sin la otra no tienen sentido. Una porque si nuestros cursos y contenidos valen la pena es porque los imparte el equipo de Redradix, curtido a diario en mil batallas y proyectos reales. La otra, porque una de las cosas que hacen que llevemos 10 años al pie del cañón es nuestro carácter didáctico. Ya sea en charlas, talleres, katas o conversaciones de Slack, siempre compartimos todo lo que vamos aprendiendo. Para que nos conozcas más: nos alejamos de lo que nos suene a bullshit. Y no engañamos a nadie. \n Classe es la formación que nos habría gustado tener en nuestros primeros años trabajando en productos digitales. Una formación complementaria para quienes nos dedicamos al desarrollo y diseño digital, que no es teoría ni se queda en ella. Una formación que se basa en el día a día de las personas que la imparten -grandes profesionales en activo- y en todo lo que han ido aprendiendo para mejorar en sus proyectos y sus carreras. Una formación que comparte las bases que hacen que contemos con cracks del desarrollo en nuestro equipo. \n Classe quiere compartir todo esto en cursos abiertos de acceso libre para gente que ya sabe de qué va esto de programar y hacer producto digital. Y también con cursos que se adaptan a las empresas para que mejoren las habilidades de sus equipos y dar así el salto que necesitan en sus proyectos. \n Classe va de aprender para poder ponerlo en práctica después y de ser mejor profesional, incluso si crees que ya lo sabes todo. ",

  "courses:header": "Cursos",
  "courses:claim": "<line>Formación</line> <line>para</line> <lineTab>profesionales</lineTab> <line>por</line> <lineTab>profesionales</lineTab>",
  "courses:description": "Sí. Sabes programar. Pero todavía no eres experto. Y este es el impulso que tu carrera necesita para alcanzar el trabajo que te mereces.",
  "courses:button": "Pregúntanos",
  "courses:closing": "Cierre",

  "course:button": "Inscribirme",
  "course:need-more-details": "¿Necesitas más detalles?",
  "course:contact-us": "Contáctanos",
  "course:index-title": "Índice",
  "course:convocation": "Próxima convocatoria",

  "course:pdf-title": "Dosier del curso",
  "course:pdf-button": "Descargar",

  "course:js-title": "Desarrollo",
  "course:js-title-modal": "Desarrollo con js",
  "course:js-alt-image": "Un hombre de perfil trabajando con su ordenador",
  "course:js-schema-description": "El mejor curso para aprender JavaScript en profundidad. Los cimientos sobre los que apoyar conocimientos futuros.",
  "course:js-description": "Brendan Eich escribió la primera versión de JS en 10 días. 25 años después sigue siendo una parte clave dentro y fuera de Internet. Este curso va más allá de las nociones básicas y empieza donde otros acaban. Profundizaremos en conceptos de programación avanzados desde el punto de vista de este lenguaje y hurgaremos en las tripas de JS para conquistarlo y entender sus pros y sus contras.",
  "course:js-01-title": "Fundamentos",
  "course:js-01-description": "Básicos avanzados para ir calentando. Ámbito de una variable, hoisting, igualdad... para que puedas explotar el lenguaje de maneras que no imaginabas.",
  "course:js-02-title": "<line>Estructuras</line> <line>de datos I</line>",
  "course:js-02-description": "Los tipos de datos complejos vistos desde una perspectiva diferente, aplicados en técnicas como la recursividad o el destructuring y  utilizando Lodash.",
  "course:js-03-title": "<line>Funciones</line> <line>de primer orden</line>",
  "course:js-03-description": "Ponemos a prueba la programación funcional, profundizando en conceptos clave como las funciones puras, las clausuras o la inmutabilidad, y entendemos en qué casos puede ayudarnos.",
  "course:js-04-title": "<line>Estructuras</line> <line>de datos II</line>",
  "course:js-04-description": "Vemos las tripas del lenguaje, entendiendo su orientación a prototipos y cómo simulan estructuras complejas de la programación orientada a objetos.",
  "course:js-05-title": "Asincronía I",
  "course:js-05-description": "Entendemos el problema de la asincronía y analizamos casuísticas y patrones que se pueden resolver de forma diferente, por ejemplo, con observables.",
  "course:js-06-title": "Asincronía II",
  "course:js-06-description": "Estudiamos diferentes soluciones, desde promesas y como serializar y paralelizar llamadas hasta async/await y su azúcar sintáctico.",
  "course:js-optional-title": "<line>Módulos</line> <line>opcionales</line>",
  "course:js-optional-description": "Podemos complementar el curso con distintos módulos de 4 horas sobre lenguaje tipado con typescript, estrategias de testing, graphQL y las mejoras propuestas para ECMAScript.",
  "course:js-prework-title": "<line>PREWORK Y</line> <line>TRABAJO FINAL</line>",
  "course:js-prework-description": "Además de las 30 horas de clases, el curso incluye un trabajo inicial y otro final para preparar por tu cuenta. El equipo docente te dará toda la información para realizarlos y comentará contigo dudas y resultados.",
  "course:js-learn": "<line>Con este</line> <line>curso</line> <line>aprenderás:</line>",
  "course:js-learn-description": "Básicamente: JavaScript en profundidad. Los cimientos sobre los que apoyar conocimientos futuros. Verás que se puede pasar de Angular a React en horas si las bases son sólidas. No solo eso, tus compañeros te agradecerán que tu código sea robusto, escalable y, sobre todo, legible.",
  "course:js-objectives": "<line>¿Es para</line> <line>mí?</line>",
  "course:js-objetives-description": "Este es un curso avanzado para profesionales que han trabajado en desarrollo web al menos durante un año. Está centrado en learn by doing con ejercicios divertidos para hacer y corregir en vivo. Live programming al poder!",

  "course:ui-dev-title": "Maqueta",
  "course:ui-title-modal": "Maqueta",
  "course:ui-dev-alt-image": "Un hombre de perfil trabajando en su portátil",
  "course:ui-dev-meta-description": "El mejor curso para profundizar en la maquetación para crear plataformas accesibles, dinámicas, escalables y usables.",
  "course:ui-dev-description": "Creemos en la división de responsabilidades y consideramos la maquetación como una disciplina en sí misma con un alto grado de especialización. Así lo hemos hecho en Redradix desde hace mas de 10 años y hemos aprendido mucho por el camino. En este curso profundizaremos en la maquetación para crear plataformas accesibles, dinámicas, escalables y usables. Atacando conceptos como arquitectura CSS, o analizando cuándo usar diferentes layouts, navegaremos a través de ejemplos cotidianos que te pondrán contra las cuerdas. No es un curso de iniciación. ¿Sabes HTML y CSS? En este curso te lo vas a replantear.",
  "course:ui-dev-01-title": "<line>Estructura</line> <line>del código</line>",
  "course:ui-dev-01-description": "Buenas prácticas, accesibilidad son algunos de los temas de los que hablaremos desde una perspectiva avanzada. Al finalizar el módulo tendrás claro cómo crear, estructurar y poner en producción un proyecto.",
  "course:ui-dev-02-title": " <line>CSS</line> <line>Avanzado</line>",
  "course:ui-dev-02-description": "Una vez entendidas todas las posibilidades que nos da el lenguaje, profundizaremos en conceptos avanzados como arquitecturas CSS, transformaciones, transiciones y animaciones, filtros y modos de fusión o variables CSS, por poner algunos ejemplos.",
  "course:ui-dev-03-title": "<line>FLEXBOX Y </line> <line>CSS GRID</line>",
  "course:ui-dev-03-description": "Dada la relevancia que han cogido en los últimos tiempos, tanto Flexbox como Grid merecen un reservado donde ver todos sus entresijos y cómo pueden simplificar nuestras vidas.",
  "course:ui-dev-04-title": "HERRAMIENTAS",
  "course:ui-dev-04-description": "Haremos un repaso por las tecnologías más usadas hoy en día y los recursos más importantes para estar actualizado y seguir aprendiendo.",
  "course:ui-dev-05-title": "<line>PREWORK Y</line><line> TRABAJO FINAL</line>",
  "course:ui-dev-05-description": "Además de las 30 horas de clases, el curso incluye un trabajo inicial y otro final para preparar por tu cuenta. El equipo docente te dará toda la información para realizarlos y comentará contigo dudas y resultados.",
  "course:ui-dev-learn": "<line>Con este</line> <line>curso</line> <line>aprenderás:</line>",
  "course:ui-dev-learn-description": "Estamos hartos de ver comportamientos responsive defectuosos, transiciones que no fluyen o scrolls que dan ganas de tirar el ordenador por la ventana. Basta ya! Este curso te ayudará a crear interfaces que respeten los estándares y, sobre todo, a los usuarios.",
  "course:ui-dev-objectives": "<line>¿Es para</line> <line>mí?</line>",
  "course:ui-dev-objetives-description": "Este es un curso avanzado para profesionales que han trabajado en desarrollo web al menos durante un año. Está centrado en learn by doing con ejercicios divertidos para hacer y corregir en vivo. Live programming al poder!",

  "course:front-react-title": "Front-end",
  "course:front-react-title-modal": "Front-end con ReactJS",
  "course:front-react-alt-image": "Una mujer de perfil trabajando con su portátil y un grupo de personas en el fondo desenfocadas",
  "course:front-react-schema-description": "El mejor curso para aprender no solo React, sino más importante: por qué React.",
  "course:front-react-description": "El mundo front cambia rápidamente y nosotros con él. Nos adaptamos y evolucionamos según lo hacen las necesidades del desarrollo. Abrazamos los nuevos paradigmas y ponemos en tela de juicio las tendencias. Con los años hemos aprendido a diferenciar las modas pasajeras de los patrones que ayudan a crear mejor código. Y eso es lo que queremos enseñarte. Desde exprimir las APIs del navegador para no depender de librerías externas hasta diseccionar React para interiorizar las implicaciones del flujo unidireccional de datos. Principios de diseño y buenas prácticas que mejoren la legibilidad de tu código hasta el punto de que volver a él sea una experiencia placentera. Para quienes les guste el desarrollo front y quieran profundizar en él.",
  "course:front-react-01-title": "Fundamentos",
  "course:front-react-01-description": "Es necesario tener conocimiento de las posibilidades que ofrece el navegador: APIs, protocolos de comunicación, formularios o navegación. En verdad, solo así podremos construir algo verdaderamente escalable.",
  "course:front-react-02-title": "<line>Librerías y</line> <line>frameworks</line>",
  "course:front-react-02-description": "Haremos una revisión del panorama de frameworks y librerías punteras, remarcando en qué destaca cada una y cuándo conviene utilizarla.",
  "course:front-react-03-title": "React",
  "course:front-react-03-description": "Nos centraremos en la librería que se ha ganado el derecho a ser el referente del desarrollo front. Profundizaremos en JSX, ciclo de vida, flujo unidireccional, renderizado condicional y tocaremos temas controvertidos como sus efectos secundarios o React Suspense.",
  "course:front-react-04-title": "<line>Módulos</line> <line>opcionales</line>",
  "course:front-react-04-description": "Este curso tiene un montón de módulos opcionales con los que complementar una asignatura tan compleja como el desarrollo front. Algunos relacionados con React como ReactRouter, ReactQuery o Redux, y otros  como testing en front, webextensions o i18n.",
  "course:front-react-05-title": "<line>PREWORK Y</line><line> TRABAJO FINAL</line>",
  "course:front-react-05-description": "Además de las 30 horas de clases, el curso incluye un trabajo inicial y otro final para preparar por tu cuenta. El equipo docente te dará toda la información para realizarlos y comentará contigo dudas y resultados.",
  "course:front-react-learn": "<line>Con este</line> <line>curso</line> <line>aprenderás:</line>",
  "course:front-react-learn-description": "No solo React, sino más importante: por qué React, cómo funciona, cuándo aplicarlo, patrones y antipatrones y en qué elementos del navegador se apoya. La versatilidad de React es muy amplia, como demuestran los proyectos de nuestro a día a día en Redradix. Queremos contarte cómo lo hacemos.",
  "course:front-react-objectives": "<line>¿Es para</line> <line>mí?</line>",
  "course:front-react-objetives-description": "Este es un curso avanzado para profesionales que han trabajado en desarrollo front al menos durante un año. Está centrado en learn by doing con ejercicios divertidos para hacer y corregir en vivo. Live programming al poder!",

  "course:back-node-title": "Back-end",
  "course:back-node-title-modal": "Back-end con NodeJS",
  "course:back-node-alt-image": "Un hombre trabajando con su ordenador mirando fijamente la pantalla",
  "course:back-node-schema-description": "En Redradix hemos hecho tantos backends como frontends hemos integrado con backends externos. Tenemos las dos visiones: cómo debería ser un backend desde el punto de vista de su consumo por un cliente y también desde dentro para que sea robusto, pero a la vez flexible y escalable. En este curso vamos a navegar por diferentes ejemplos reales de problemas a los que en algún momento nos hemos enfrentado. Desde la creación de APIs hasta patrón repositorio o arquitectura hexagonal, siempre desde el punto de vista práctico.",
  "course:back-node-description": "En Redradix hemos hecho tantos backends como frontends hemos integrado con backends externos. Tenemos las dos visiones: cómo debería ser un backend desde el punto de vista de su consumo por un cliente y también desde dentro para que sea robusto, pero a la vez flexible y escalable. En este curso vamos a navegar por diferentes ejemplos reales de problemas a los que en algún momento nos hemos enfrentado. Desde la creación de APIs hasta patrón repositorio o arquitectura hexagonal, siempre desde el punto de vista práctico.",
  "course:back-node-01-title": "<line>Core</line> <line>Modules</line>",
  "course:back-node-01-description": "¿Qué es Node y qué partes lo componen? Veremos módulos como Stream, CLI o Process, complejos pero necesarios para entender las tripas de este runtime tan querido por todos. Y esto nos servirá para sentar las bases para el resto del curso.",
  "course:back-node-02-title": "<line>HTTP y</line> <line>HTTPS</line>",
  "course:back-node-02-description": "Desde cómo crear un servidor a cómo servir contenido a las bases de una buena API REST o el uso de proxies.",
  "course:back-node-03-title": "Express",
  "course:back-node-03-description": "Como framework de facto, debemos conocer sus patrones recurrentes y middlewares. También sus estrategias de autenticación, haciendo hincapié en arquitecturas por capas.",
  "course:back-node-04-title": "<line>Programación</line> <line>asíncrona</line>",
  "course:back-node-04-description": "Utilizaremos Koa como base para entender y ejercitar los conocimientos sobre promesas, async/await y generadores.",
  "course:back-node-05-title": "<line>Persistencia</line> <line>de datos</line>",
  "course:back-node-05-description": "Relacionales, documentales, clave valor y también una ligera pincelada sobre las bases de datos de grafos para entender sus pros y contras. Y, sobre todo, cuándo es bueno utilizar cada una.",
  "course:back-node-06-title": "<line>Módulos</line> <line>opcionales</line>",
  "course:back-node-06-description": "Podemos complementar con pequeños módulos de 4 horas sobre server side rendering, SMTP o, incluso, procesamiento y almacenamiento en la nube.",
  "course:back-node-07-title": "<line>PREWORK Y</line><line> TRABAJO FINAL</line>",
  "course:back-node-07-description": "Además de las 30 horas de clases, el curso incluye un trabajo inicial y otro final para preparar por tu cuenta. El equipo docente te dará toda la información para realizarlos y comentará contigo dudas y resultados.",
  "course:back-node-learn": "<line>Con este</line> <line>curso</line> <line>aprenderás:</line>",
  "course:back-node-learn-description": "El 80% de los proyectos que hacemos en Redradix tienen APIs, programación asíncrona o persistencia de datos. Queremos contarte cómo lo hacemos utilizando Node.js, para que tú puedas aplicar estos conocimientos desde el primer día, creando servicios robustos y escalables de los que estar orgulloso.",
  "course:back-node-objectives": "<line>¿Es para</line> <line>mí?</line>",
  "course:back-node-objetives-description": "Este es un curso avanzado para profesionales que han trabajado en desarrollo back-end al menos durante un año. Está centrado en learn by doing con ejercicios divertidos para hacer y corregir en vivo. Live programming al poder.",

  "course:objectives-title": "Objetivos",
  "course:euros": "<line>euros</line>",
  "course:hours": "<line>horas</line>",
  "course:places": "<line>plazas</line>",
  "course:practical": "<line>% práctico</line>",
  "course:students": "<line>alumnos</line> <line>inscritos</line>",
  "course:contact": "¿Echas algo en falta? Puedes combinar el temario de todos nuestros cursos para que se adapte mejor a lo que buscas",

  "custom:header": "Personaliza",
  "custom:title": "<line>Nuestros</line> <lineTabAriaHidden>cursos=</lineTabAriaHidden> <screenReadOnly>cursos</screenReadOnly> <lineTab>a tu</lineTab> <lineTab>medida</lineTab> <screenReadOnly>¿Quieres saber cómo?</screenReadOnly>",
  "custom:description": "Una misma formación, por muy buena que sea, no tiene por qué valerle a todo el mundo. Por eso, con los cursos que hacemos en Classe puedes hacerte un bundle con lo que más se adapte a ti.\n Sabemos lo complicado que es planificarse y contar con un rato fuera de la jornada para seguir formándose. Por eso te lo ponemos fácil y hacemos nuestros cursos en remoto. Eso sí, manteniendo el trato personalizado y la cercanía del profesor, que para algo llevamos años remoteando y haciendo pair programming, entre nosotros y con otros equipos.\n Y aunque se graban por si algún día te pierdes una sesión, todas las clases son  en directo para poder sacar el máximo partido de todos los que participan en ella. Las preguntas en vivo se responden mejor y nuestro equipo está dispuesto a hacer de patito de goma si en algún momento te hace falta.",
  "custom:claim": "<lineTab>¿Quieres</lineTab> <line>saber</line> <line>cómo?</line>",
  "custom:button": "Ver cursos",

  "featured:header": "Curso destacado",
  "featured:title": "<lineTabAriaHidden>Progra-</lineTabAriaHidden><lineTabAriaHidden>mación</lineTabAriaHidden><screenReadOnly>Programación</screenReadOnly> <line>con</line> <line>JavaScript</line>",
  "featured:button": "¿Quieres saber más? Echa un ojo al curso",

  "facts:header": "Facts",
  "facts:title": "<line>Cuando decimos no</line> <lineTab>bullshit, es no bullshit</lineTab>",
  "facts:fact1": "Con motivación y preparación, un programador puede reducir hasta 10 veces el número de errores que comete.",
  "facts:fact2": "Nuestros cursos no son bootcamps de iniciación, están enfocados a gente que programa en su día a día y que quiere profundizar en la profesión.",
  "facts:fact3": "No tenemos profesores. Solo profesionales que llevan años sacando todo tipo de proyectos. Y que saben lo que realmente importa en el día a día.",
  "facts:fact4": "Los perfiles senior ganan, de media, 30.000€ más que los junior.",
  "facts:fact5": "Un 60% de quienes ya se han formado con nosotros encontró un puesto de trabajo mejor remunerado a los tres meses de asistir a alguno de nuestros cursos.",
  "facts:fact6": "Todos los cursos se basan en JS porque creemos en la especialización y es el lenguaje que utilizamos en Redradix.",

  "calendar:header": "Calendario",
  "calendar:title": "<line>Haz</line> <line>hueco</line> <lineTab>(en tu</lineTab> <lineTab>agenda)</lineTab>",
  "calendar:description": "De forma general, las clases se impartirán de lunes a jueves de 18:00h a 20:30h.",
  "calendar:no-courses": "Escríbenos para enterarte antes que nadie ",
  "calendar:start": "Start",
  "calendar:finish": "Finish",
  "calendar:schedule": "LMXJ",

  "companies:header": "Empresas",
  "companies:title": "<lineAriaHidden>#</lineAriaHidden><lineTab>Empresas</lineTab> <lineTab>que han</lineTab> <lineTab>vuelto a</lineTab> <lineTabAriaHidden>Class(e)</lineTabAriaHidden><screenReadOnly>Classe</screenReadOnly> <lineAriaHidden>#</lineAriaHidden>",
  "companies:button": "¿Quieres ser una de ellas? contáctanos",

  "faqs:header": "Faq's",
  "faqs:title": "<lineAriaHidden>//Aprender es no parar</lineAriaHidden><screenReadOnly>Aprender es no parar</screenReadOnly> <lineTab>de preguntar</lineTab>",
  "faqs:faq1-title": "LLEVO POCO TIEMPO EN ESTO DEL DESARROLLO, ¿ESTE CURSO ES PARA MÍ?",
  "faqs:faq1-description": "No creemos en los años de experiencia. Creemos en la pasión por la programación. Si tienes unas bases sólidas sobre las que trabajar, entonces podemos hacer magia.",
  "faqs:faq2-title": "¿CÓMO CONVENZO A MI EMPRESA PARA QUE ORGANICE UNO DE LOS CURSOS?",
  "faqs:faq2-description": "Dile a la persona responsable que nos contacte. Seguro que es consciente de en qué podéis mejorar. Y nosotros podemos explicarle cómo podéis hacerlo y cómo nuestros cursos se adaptan a las necesidades de cada empresa. También podemos hablar de resultados: menos errores en programación, menos dolores de cabeza y una mayor productividad.",
  "faqs:faq3-title": "¿HAY BENEFICIOS PARA LAS EMPRESAS CON VUESTROS CURSOS?",
  "faqs:faq3-description": "Sí. Tenemos acuerdos con la Fundación Tripartita, así que nuestros cursos se pueden financiar a través de ellos.",
  "faqs:faq4-title": "HE VISTO QUE LA FORMACIÓN UTILIZA EL LENGUAJE JS, ¿POR QUÉ?",
  "faqs:faq4-description": "En nuestros cursos vamos a hablar de buenas prácticas, de principios de diseño, patrones, etc. Todo en un sentido práctico. Y para ello tenemos que utilizar un lenguaje real y el que usamos en Redradix es JS. Es un lenguaje flexible y ejemplifica muy bien los paradigmas de la programación.",
  "faqs:faq5-title": "EN MI EMPRESA TRABAJAMOS CON OTROS LENGUAJES, ¿ME OLVIDO ENTONCES DE VUESTROS CURSOS?",
  "faqs:faq5-description": "Depende. Hay mucha gente que viene de otros lenguajes, en el caso de que quieras aprender JS este es tu curso, sin dudarlo. Además, tenemos los cursos de maqueta.",
  "faqs:faq6-title": "¿RECIBIRÉ ALGUNA TITULACIÓN AL TERMINAR EL CURSO?",
  "faqs:faq6-description": "Te daremos un certificado no homologado. En cambio, sí que te llevarás muchos aprendizajes que te ayudarán a demostrar lo que vales sobre el terreno. Y eso nos parece más importante que un certificado oficial.",
  "faqs:faq7-title": "SI HAGO ALGUNO DE LOS CURSOS, ¿PUEDO ACCEDER LUEGO A LOS MATERIALES ONLINE?",
  "faqs:faq7-description": "Sí, las clases son grabadas y podrás acceder a los vídeos y también a los repositorios. Además, mejor aún, podrás asistir como oyente en las siguientes convocatorias del curso. ",
  "faqs:faq8-title": "¿NECESITO ALGÚN EQUIPO O PROGRAMA ESPECIAL?",
  "faqs:faq8-description": "Todo el mundo debe utilizar su ordenador porque se trabaja más cómodamente. Nos da igual la herramienta que uses, con la que más a gusto estés, aunque te pediremos unos requisitos mínimos como un editor de código y que te instales NodeJS. Más allá de eso, y de tener buena conexión a Internet para poder conectarte, lo único que te pedimos es que llegues con ganas de seguir aprendiendo cada día.",
  "faqs:faq9-title": "¿CUÁLES SON LAS FORMAS DE PAGO?",
  "faqs:faq9-description": "El pago se realiza mediante tarjeta bancaria. Una vez realices tu inscripción, te enviaremos un enlace para poder hacerlo de forma segura. ",
  "faqs:faq10-title": "¿QUÉ PASA SI HAY ALGÚN FESTIVO DURANTE MI CURSO?",
  "faqs:faq10-description": "Si te coincide alguno, disfrútalo. Y no te preocupes, porque se recuperarán las horas pendientes el resto de días, buscando el mayor consenso entre todos.",
  "faqs:faq11-title": "¿NO SE PIERDE CALIDAD AL NO SER PRESENCIAL?",
  "faqs:faq11-description": "Creemos que no y la experiencia trabajando en remoto desde antes de la pandemia nos da la razón. En Redradix aprendemos cada día y no nos hace falta estar físicamente al lado para ello. Confía en nosotros, aunque sea de forma virtual podrás acercarte a la mesa del profesor para preguntarle tus dudas en un ejercicio.",

  "find:header": "Encuéntranos",
  "find:title": "<lineAriaHidden>Encuéntra-</lineAriaHidden><lineAriaHidden>nos en la</lineAriaHidden><screenReadOnly>Encuéntranos en la</screenReadOnly> <lineTab>Latina</lineTab> <screenReadOnly>y detrás de la pantalla</screenReadOnly>",
  "find:description": "Aunque el curso sea en remoto, si algún día te apetece pasar a saludar al equipo de Redradix, estamos en pleno centro de Madrid, en la calle Calatrava 27, al lado del Metro de La Latina (y cerca también de las estaciones de Puerta de Toledo o Tirso de Molina).",
  "find:description2": "INFO<ariaHidden>[at]</ariaHidden><screenReader>@</screenReader>classe.dev",
  "find:claim": "<line>Y detrás</line> <lineTab>de la</lineTab> <lineTab>pantalla</lineTab>",

  "contact:second-title": "<line>Contacta</line> <line>con Classe</line>",
  "contact:address1": "<line>Madrid, Calatrava, 27</line> <line>[Metro La Latina]</line>",
  "contact:address2": "<lineAriaHidden>info[at]classe.dev</lineAriaHidden><screenReadOnly>info@classe.dev</screenReadOnly>",
  "contact:my-name-is": "<line>Ey! Me llamo</line>",
  "contact:interested-in": "<line>Me interesa el curso de</line>",
  "contact:my-email": "<line>Y este es mi correo</line>",
  "contact:success": "Gracias! Te responderemos lo antes posible.",
  "contact:address-link": "https://www.google.es/maps/place/Redradix/@40.4092458,-3.7143432,17z/data=!3m1!4b1!4m5!3m4!1s0xd42287e4a90167b:0x9bfdc0ed1f91d800!8m2!3d40.4092458!4d-3.7121545?shorturl=1",

  "footer:header": "Bye bye",
  "footer:title": "<line>Stay</line> <lineTab>in the</lineTab> <lineTab>know</lineTab>",
  "footer:iam": "Soy",
  "footer:company": "Empresa",
  "footer:student": "Alumno",
  "footer:social": "Social",
  "footer:contact": "Contacto",
  "footer:legal": "Legal",
  "footer:legal-terms": "Términos legales",
  "footer:legal-terms-route": "/terminos-legales/",
  "footer:cookies": "Cookies",
  "footer:cookies-route": "/cookies/",
  "footer:brand": "POWERED BY REDRADIX * CLASSE ACADEMY(c) ",

  "error:page-not": "Page not",
  "error:found": "found",
  "error:back-to-homne": "Volver a la home",

  "konami:congrats": "¡Enhorabuena!",
  "konami:unlock-discount": "Has desbloqueado un descuento para los cursos.",
  "konami:use-it-1": "Para usarlo, deberás introducir tu nombre",
  "konami:use-it-2": "en el formulario de \"Contacta\" de la siguiente manera:",
  "konami:how-to": "%c[VIP] - tu_nombre",
  "konami:example": "Por ejemplo: %c[VIP] - Luke Skywalker",

  "cookies-layer:aria-label": "Modal política de cookies",
  "cookies-layer:title": "Política de cookies",
  "cookies-layer:description": "Esta web almacena cookies y tecnologías similares propias y de terceros en tu dispositivo. Estas cookies se utilizan únicamente con fines analíticos para recopilar información anónima sobre cómo interactúas con nuestra web. <link>Puedes saber más sobre estas cookies aquí</link>.",
  "cookies-layer:link": "Saber más",
  "cookies-layer:button-accept": "Aceptar",
  "cookies-layer:button-refuse": "Rechazar",

  "legal-terms:modify-note": "Redradix SL. Última versión del 26 de octubre de 2022.",
  "legal-terms:title": "<line>Términos</line> <lineTab>legales</lineTab>",
  "legal-terms:section01-title": "Aviso legal",
  "legal-terms:section01-sub01": "Titularidad del sitio web",
  "legal-terms:section01-sub01-block-1": "El titular de la presente página web es Redradix S.L. con CIF: B86840394 y domicilio en la Calle Calatrava, 27 de Madrid, inscrita en el Registro Mercantil de Madrid - Tomo 31.483, Folio 152, Hoja M-566718, inscripción 1ª.",
  "legal-terms:section01-sub02": "Condiciones generales de uso",
  "legal-terms:section01-sub02-block-1": "El objetivo de esta página web es facilitar información sobre los servicios de formación ofrecidos por Classe, todos los cursos ofertados y contenidos relacionados. Toda la información recogida en esta página web tiene carácter meramente informativo, pero no es vinculante.",
  "legal-terms:section01-sub02-block-2": "Redradix, como titular de la página web, se reserva además el derecho de realizar, sin aviso previo, cuantas modificaciones considere necesarias en esta página web, por lo que no garantiza ni se hace responsable de la continuidad de los contenidos.",
  "legal-terms:section02-title": "Política de privacidad",
  "legal-terms:section02-block-1": "La siguiente información en materia de privacidad se aplicará en el marco de la visita a nuestra web y otras webs asociadas. Aquí informamos sobre el tipo, la finalidad y el alcance de los tratamientos de datos. Somos conscientes de la importancia que reviste un tratamiento cuidadoso de los datos personales. Por esta razón, nos atenemos así estrictamente a la normativa legal a la hora de recoger, tratar y usar datos personales. A fin de garantizar la protección de datos personales, hacemos uso de medidas de naturaleza tecnológica y organizativa para proteger de forma fiable los datos. Estas incluyen medidas de seguridad de orden procesal y electrónico en relación con el tratamiento de los datos, al igual que formaciones de nuestra plantilla y la obligación de la misma al cumplimiento de la confidencialidad de los datos. Nuestros usuarios pueden contactar en cuestiones de privacidad en relación con los usos mencionados al responsable del tratamiento de los datos a efectos de lo dispuesto en el artículo 4.7 del RGPD:",
  "legal-terms:section02-block-2": "REDRADIX SL",
  "legal-terms:section02-block-3": "CIF B86840394",
  "legal-terms:section02-block-4": "c/ Calatrava 27, 28005, Madrid",
  "legal-terms:section02-block-5": "info@redradix.com",
  "legal-terms:section03-title": "1. Datos de carácter personal",
  "legal-terms:section03-block-1": "La información siguiente se refiere al tratamiento de datos de carácter personal. Datos de carácter personal son todos los datos concernientes a una persona física identificada o identificable, pudiendo tratarse de datos como, por ejemplo, el nombre, el domicilio o la dirección de correo electrónico, así como de los hábitos de uso.",
  "legal-terms:section04-title": "2. Recogida de datos en cada acceso a las webs",
  "legal-terms:section04-sub01": "a) Datos de uso",
  "legal-terms:section04-sub01-block-1": "En cada acceso a nuestras web y webs asociadas, incluso con fines meramente informativos, procedemos a recoger algunos datos estadísticos de uso de la web mediante cookies. ",
  "legal-terms:section04-sub02": "b) Cookies y proveedores externos de analítica web",
  "legal-terms:section04-sub02-block-1": "https://www.classe.dev/cookies",
  "legal-terms:section04-sub02-block-2": "Nuestra página web almacena cookies y tecnologías similares propias y de terceros en el dispositivo. Estas cookies se utilizan exclusivamente con fines analíticos para recopilar información de carácter anónimo sobre la forma en que se interactúa con la web y mejorar la experiencia de navegación para nuestros visitantes.",
  "legal-terms:section04-sub02-block-3": "Una cookie es un archivo de texto que se almacena en el ordenador o dispositivo móvil mediante un servidor web y tan solo ese servidor es capaz de recuperar o leer el contenido de la cookie. Por lo general estas cookies permiten al sitio web recordar preferencias de navegación y navegar de manera eficiente, o recopilar información anónima para usos estadísticos. Las cookies hacen la interacción entre el usuario y el sitio web más rápida y fácil.",
  "legal-terms:section04-sub03": "¿Qué cookies utilizamos?",
  "legal-terms:section04-sub03-block-1": "En esta web empleamos cookies analíticas de terceros. La finalidad de estas es conocer datos estadísticos de uso de la web, como el número de usuarios o los contenidos que más se consultan. De esta manera podemos concentrar nuestros esfuerzos en mejorar nuestra web y las áreas más visitadas y hacer que el usuario encuentre más fácilmente lo que busca. La información de las visitas puede utilizarse para realizar evaluaciones y métricas siempre con datos anónimos.",
  "legal-terms:section04-sub03-block-2": "Como usuario, debes asegurarte de que estás conforme con ellas antes de seguir navegando. Todas nuestras cookies son analíticas.",
  "legal-terms:section04-sub03-block-3": "También puedes configurar el navegador para que no acepte cookies, aunque eso puede afectar al correcto funcionamiento de la aplicación.",
  "legal-terms:section05-title": "3. Tratamiento de datos adicional en caso de suscripción a la newsletter y contacto para información sobre nuestros servicios",
  "legal-terms:section05-sub01": "a) Suscripción a la newsletter",
  "legal-terms:section05-sub01-block-1": "Nuestras newsletters proporcionan información periódica sobre acciones y novedades. Las newsletters se suscriben en nuestras webs indicando una dirección de correo electrónico válida.",
  "legal-terms:section05-sub01-block-2": "Este consentimiento se puede retirar en todo momento con efecto  a través del enlace de cancelación de la suscripción provisto en cada correo electrónico.",
  "legal-terms:section05-sub02": "b) Correo electrónico",
  "legal-terms:section05-sub02-block-1": "Cuando se nos contacta por correo electrónico, utilizamos la dirección de correo electrónico y el nombre de la persona que nos contacta para poder tramitar la consulta o enviar una respuesta.",
  "legal-terms:section05-sub03": "c) Cuestionarios",
  "legal-terms:section05-sub03-block-1": "Podemos realizar, en su caso, cuestionarios en línea para entender sus áreas de interés/ posibles necesidades de nuestros servicios. Por medio de estos cuestionarios deseamos aprovechar su opinión para mejorar continuamente la información que proporcionamos. El consentimiento correspondiente (artículo 6 apartado 1 letra a) del RGPD) como base legal para este tratamiento se puede retirar en cualquier momento.",
  "legal-terms:section06-title": "4. Cesión de datos de carácter personal",
  "legal-terms:section06-block-1": "Los datos personales que nos son confiados son utilizados únicamente para contestar consultas realizadas en nuestras webs sobre nuestros servicios o la suscripción a la newsletter, y no cedemos estos datos a terceros en ningún caso.",
  "legal-terms:section06-block-2": "No obstante, a Redradix SL corresponde en algunos casos una obligación legal de ceder datos a terceros (artículo 6 apartado 1 letra c) del RGPD). Así nos corresponde en especial una obligación de ceder a solicitud datos a las autoridades judiciales en caso de posible comisión de un delito.",
  "legal-terms:section07-title": "5. Duración del tratamiento",
  "legal-terms:section07-block-1": "Cuando no se indica expresamente una duración de la conservación de datos en otra parte de esta declaración de privacidad, los datos se conservan hasta que su tratamiento no resulta ya necesario para los fines para los que se recogieron.",
  "legal-terms:section08-title": "6. Derechos de las personas interesadas",
  "legal-terms:section08-sub01": "a) Derecho de acceso",
  "legal-terms:section08-sub01-block-1": "Los clientes tienen derecho a obtener de nosotros una confirmación de si se están tratando o no datos personales que les conciernen y, en tal caso, de los datos que se están tratando y los detalles del tratamiento de datos (artículo 15 del RGPD).",
  "legal-terms:section08-sub02": "b) Derecho de rectificación",
  "legal-terms:section08-sub02-block-1": "Los clientes tienen derecho obtener sin dilación indebida la rectificación de los datos personales inexactos que les conciernan. Teniendo en cuenta los fines del tratamiento, tienen además derecho a que se completen los datos personales que sean incompletos (artículo 16 del RGPD).",
  "legal-terms:section08-sub03": "c) Derecho de supresión",
  "legal-terms:section08-sub03-block-1": "Una vez finalizado su uso respectivo, los datos personales son suprimidos de nuestros ficheros.",
  "legal-terms:section08-sub03-block-2": "Los clientes tienen derecho a solicitar en cualquier momento la supresión de sus datos cuando se cumplan los requisitos del artículo 17 del RGPD.",
  "legal-terms:section08-sub04": "d) Derecho a un tratamiento limitado",
  "legal-terms:section08-sub04-block-1": "Los clientes tienen derecho a solicitar la limitación del tratamiento de sus datos personales cuando se cumpla alguna de las condiciones del artículo 18 del RGPD.",
  "legal-terms:section08-sub05": "e) Derecho a la portabilidad de los datos",
  "legal-terms:section08-sub05-block-1": "Los clientes tienen derecho a recibir los datos de carácter personal que les incumban y nos hayan facilitado en un formato estructurado, de uso común y lectura mecánica y a transmitirlos a otro responsable del tratamiento sin que lo impidamos cuando se cumplan los requisitos del artículo 20 del RGPD.",
  "legal-terms:section08-sub06": "f) Derecho de oposición",
  "legal-terms:section08-sub06-block-1": "De conformidad con lo previsto en el art. 21 del RGPD, clientes tienen derecho a oponerse en cualquier momento, por motivos relacionados con su situación particular, a que datos personales que les conciernan sean objeto de un tratamiento basado en lo dispuesto en el artículo 6 apartado 1 letras e) o f) del RGPD.",
  "legal-terms:section08-sub07": "g) Retirada del consentimiento",
  "legal-terms:section08-sub07-block-1": "El consentimiento otorgado en el uso de los datos podrá ser retirado en cualquier momento informalmente con efectos para el futuro (artículo 7 apartado 3 del RGPD), lo que podrá resultar, en función del caso individual, en la imposibilidad de usar en todo o en parte nuestra web.",
  "legal-terms:section08-sub08": "h) Derecho a presentar una reclamación",
  "legal-terms:section08-sub08-block-1": "Sin perjuicio de cualquier otro recurso administrativo o acción judicial, los clientes tienen derecho a presentar una reclamación ante una autoridad de control, en particular en el Estado miembro de la UE en el que tengan su residencia habitual, lugar de trabajo o lugar de la supuesta infracción, si consideran que el tratamiento de datos personales que les conciernen infringe la normativa en materia de protección de datos personales (artículo 77 del RGPD).",

  "cookies-policy:title": "<line>Política de</line> <lineTab>cookies</lineTab>",
  "cookies-policy:block-1": "Nuestra página web almacena cookies y tecnologías similares propias y de terceros en el dispositivo. Estas cookies se utilizan exclusivamente con fines analíticos para recopilar información de carácter anónimo sobre la forma en que se interactúa con la web y mejorar  la experiencia de navegación para nuestros visitantes.",
  "cookies-policy:block-2": "Una cookie es un archivo de texto que se almacena en el ordenador o dispositivo móvil mediante un servidor web y tan solo ese servidor es capaz de recuperar o leer el contenido de la cookie. Por lo general estas cookies permiten al sitio web recordar preferencias de navegación y navegar de manera eficiente, o recopilar información anónima para usos estadísticos. Las cookies hacen la interacción entre el usuario y el sitio web más rápida y fácil.",
  "cookies-policy:subtitle": "¿Qué cookies utilizamos?",
  "cookies-policy:block-3": "En esta web empleamos cookies analíticas de terceros. La finalidad de estas es conocer datos estadísticos de uso de la web, como el número de usuarios o los contenidos que más se consultan. De esta manera podemos concentrar nuestros esfuerzos en mejorar nuestra web y las áreas más visitadas y hacer que el usuario encuentre más fácilmente lo que busca. La información de las visitas puede utilizarse para realizar evaluaciones y métricas siempre con datos anónimos.",
  "cookies-policy:block-4": "Como usuario, debes asegurarte de que estás conforme con ellas antes de seguir navegando. Todas nuestras cookies son analíticas y puedes rechazarlas aquí.",
  "cookies-policy:block-5": "También puedes configurar el navegador para que no acepte cookies, aunque eso puede afectar al correcto funcionamiento de la aplicación.",

  "alt-image:three-web-developers": "Tres desarrolladores web desarrollando productos digitales",
  "alt-image:programming-students-attending": "Unos estudiantes de programación atendiendo a una charla",
  "alt-image:developers-working": "Un desarrollador y una desarroladora trabajando",
  "alt-image:man-working-remotely": "Un hombre trabajando en remoto visible a través de una videollamada",
  "alt-image:hands-keyboard-mouse": "Unas manos sobre un teclado y un ratón",
  "alt-image:office-desks-computer-equipment": "Oficina con varias mesas y equipos informáticos",
  "alt-image:two-web-programmers": "Dos programadores web trabajando",

  "newsletter:placeholder": "Email",
  "newsletter:btn": "Quiero saber más"
}
