{
  "url:root": "https://classe.dev",
  "url:courses": "https://classe.dev/cursos",
  "url:course": "https://classe.dev{course}",
  "url:contact": "https://classe.dev/contacto",
  "url:logo": "https://classe.dev/images/logo.png",
  "url:og-1200x1200": "https://classe.dev/images/og/og-1200x1200.png",
  "url:og-921x518": "https://classe.dev/images/og/og-921x518.png",
  "url:og-400x400": "https://classe.dev/images/og/og-400x400.png",
  "url:og-256x256": "https://classe.dev/images/og/og-256x256.png",
  "url:favicon-144": "https://classe.dev/favicon-144.png",

  "info-head-home:title": "Classe | Formación para desarrolladores por desarrolladores",
  "info-head-home:description": "Cursos de programación presenciales y online pensados para profesionales -tanto de forma particular como para empresas- e impartidos por el equipo de Redradix.",

  "info-head-courses:title": "Nuestros cursos | Classe",
  "info-head-courses:description": "Actualmente realizamos cursos para profundizar al máximo en JavaScript, Maquetación (UI Development), Desarrollo Front-end y Back-end.",

  "info-head-course:title": "Curso de {course} | Classe",
  "info-head-course:description": "Con nuestro curso de {course} asentarás todos tus conocimientos para sacarles el máximo partido en tu carrera profesional.",

  "info-head-contact:title": "Contacto | Classe",
  "info-head-contact:description": "Contacta con nosotros. Calatrava, 27 (en La Latina, Madrid) info@classe.dev",

  "schema-educational-organization:name": "Classe",
  "schema-educational-organization:lang": "es",
  "schema-educational-organization:lang-upper-case": "ES",

  "schema-website:headline": "Classe, escuela de programación",
  "schema-website:name": "Classe, escuela de programación",
  "schema-website:description": "Classe, escuela de programación para dar el salto en tu carrera profesional.",

  "schema-contact-page:name": "Classe",
  "schema-contact-page:headline": "Classe, escuela de programación",
  "schema-contact-page:description": "Si tienes cualquier duda contacta con nosotros. Classe, Escuela especialiazada en programación en Madrid.",
  "schema-contact-page:main-entity-of-page-name": "Contacto",
  "schema-contact-page:email": "info@clase.dev",
  "schema-contact-page:address": "Calle Calatrava, 27",
  "schema-contact-page:postal-code": "28005",
  "schema-contact-page:locality": "Madrid",
  "schema-contact-page:country": "España",
  "schema-contact-page:latitude": "40.41097267132999",
  "schema-contact-page:longitude": "-3.712211732196113",

  "schema-course:price-currency": "EUR",

  "schema-educational-event:location-name": "Classe, escuela de programación",
  "schema-educational-event:organitation-name": "Classe, escuela de programación",

  "schema-breadcrumb-list:home-name": "Classe, escuela de programación",
  "schema-breadcrumb-list:courses-name": "Cursos",
  "schema-breadcrumb-list:contact-name": "Contacto",

  "general:conditions-check": "Acepto los términos y condiciones",
  "general:go-to-home": "Ir a la home",
  "general:newsletter-check": "Suscribirme a la newsletter",
  "general:placeholder": "Introduce tu email",
  "general:name-lastname-placeholder": "Nombre Apellido",
  "general:send": "Enviar",

  "menu:claim": "CLASS(E) no bullshit",
  "menu:claimSmall": "CLASS(E)",
  "menu:courses": "Cursos",
  "menu:contact": "Contacta",
  "menu:open": "Menu",
  "menu:close": "Cerrar",

  "home:title": "Cursos de programación y producto digital por y para desarrolladores",

  "manifest:header": "Manifiesto",
  "manifest:claim": "<line>Más de 10 años</line> <lineTab>formando</lineTab> <lineTab>(pro)fesionales</lineTab>",
  "manifest:title": "<line>Aquí</line> <lineTab>nuestro</lineTab> <line>manifiesto</line>",
  "manifest:description": "Classe es Redradix y Redradix es Classe. La una sin la otra no tiene sentido. Una, porque si nuestros cursos y contenidos valen la pena es porque los imparte el equipo de Redradix, curtido a diario en mil batallas y proyectos reales. La otra, porque una de las cosas que hacen que llevemos 10 años al pie del cañón es nuestro carácter didáctico. Ya sea en charlas, talleres, katas o conversaciones de Slack, siempre compartimos todo lo que vamos aprendiendo. Para que nos conozcas más: nos alejamos de lo que nos suene a bullshit. Y no engañamos a nadie.\nClasse es la formación que nos habría gustado tener a nosotros en nuestros primeros años trabajando en productos digitales. Una formación complementaria para todos los que se dedican al desarrollo y diseño digital, que no es teoría ni se queda en ella. Una formación que se basa en el día a día de los que la imparten -todos profesionales en activo- y en todo lo que han ido aprendiendo para mejorar - en sus proyectos y sus carreras-. Una formación que comparte las bases que hacen que en nuestro equipo contemos con auténticos cracks del desarrollo.\nClasse quiere compartir todo esto en cursos abiertos de acceso libre para gente que ya sabe de qué va esto de programar y realizar un producto digital. Y también con cursos que se adaptan a las empresas para que mejoren las habilidades de sus equipos para dar el salto que necesitan en sus proyectos.\nClasse va de aprender para ser mejor profesional para poder ponerlo en práctica después, incluso si crees que ya lo sabes todo.",

  "courses:header": "Cursos",
  "courses:claim": "<line>Formación</line> <line>para</line> <lineTab>profesionales</lineTab> <line>POR</line> <lineTab>profesionales</lineTab>",
  "courses:description": "Sí. Sabes programar. Pero todavía no eres un experto. Y este es el impulso que tu carrera necesita para alcanzar el trabajo que te mereces.",
  "courses:button": "Pregúntanos",
  "courses:closing": "Cierre",

  "course:button": "Inscribirme",
  "course:need-more-details": "¿Necesitas más detalles?",
  "course:contact-us": "Contáctanos",
  "course:index-title": "Índice",

  "course:js-pro-description": "**Con este curso aprenderás**\nBásicamente: JavaScript en profundidad. Los cimientos sobre los que apoyar conocimientos futuros. Descubrirás que se puede pasar de Angular a React en cuestión de horas si las bases son sólidas. No solo eso, tus compañeros agradecerán a partir de ahora que tu código sea robusto, escalable y, sobre todo, legible.\n**Si te preguntas si es para ti...**\nEste es un curso avanzado para profesionales que han trabajado en desarrollo web al menos durante un año. Está centrado en *learn by doing* con ejercicios divertidos para hacer y corregir en vivo. *Live programming* al poder!",
  "course:js-pro-01-title": "<line>Tipos</line><line> de</line><line>datos</line>",

  "course:js-pro-01-description": "Empezando por Arrays y Mapas, pasando por Sets, Símbolos hasta llegar a Proxies y Objetos. Serás capaz de explotar estas estructuras como no imaginabas que fuera posible.",
  "course:js-pro-02-title": "<line>Orientación</line><line>  a</line><line>objetos</line>",
  "course:js-pro-02-description": "JavaScript es un lenguaje orientado a prototipos, así que conocer la trampa que esconde para implementar OO te ayudará a ver sus posibilidades y limitaciones.",
  "course:js-pro-03-title": "<line>Programa</line><line> ción</line><line>funcional</line>",
  "course:js-pro-03-description": "Pon un curry en tu vida y déjate seducir por las posibilidades de la programación funcional y lo mucho que puede aportar en términos de simplicidad a tu base de código.",
  "course:js-pro-04-title": "<line>Programa</line><line> ción</line><line>asíncrona</line>",
  "course:js-pro-04-description": "Está por todas partes y es necesario entender todas sus implicaciones sin que te explote la cabeza. Desde callback hell hasta generadores, pasando por la creación de una implementación de promesas y async/await.",

  "course:ui-dev-description": "**Con este curso aprenderás**\nEstamos hartos de ver comportamientos *responsive* defectuosos, transiciones que no fluyen o *scrolls* que dan ganas de tirar el ordenador por la ventana. Eso por no hablar de la web de Renfe. Basta ya! Este curso te dará el conocimiento para crear interfaces que respeten los estándares y, sobre todo, a los usuarios. Bueno y ya que estamos, y con un poco de suerte, también [que ganen premios.](https://www.awwwards.com/) 🏆\n**Si te preguntas si es para ti...**\nEste es un curso avanzado para profesionales que han trabajado en desarrollo web al menos durante un año. Está centrado en *learn by doing* con ejercicios divertidos para hacer y corregir en vivo. *Live programming* al poder!",
  "course:ui-dev-01-title": "<line>Estructura</line><line>HTML</line>",
  "course:ui-dev-01-description": "Etiquetas, imágenes, tabulación de datos, buenas prácticas sobre enlaces, validación de formularios, carga de archivos, microformatos o accesibilidad son algunos de los temas de los que hablaremos desde una perspectiva avanzada.",
  "course:ui-dev-02-title": "<line>Estructura</line><line>CSS</line>",
  "course:ui-dev-02-description": "Con una aproximación similar a la anterior, veremos conceptos complejos como la carga de archivos, el modelo de caja, selectores avanzados, pseudoclases y pseudoelementos, unidades CSS, RWD o tipografías, entre otros.",
  "course:ui-dev-03-title": "<line>CSS</line><line>Avanzado</line>",
  "course:ui-dev-03-description": "Una vez entendidas todas las posibilidades que nos da el lenguaje, profundizaremos en conceptos avanzados como arquitecturas CSS, transforaciones, transiciones y animaciones, filtros y modos de fusión o variables CSS, eso por poner algunos ejemplos.",
  "course:ui-dev-04-title": "<line>Flexbox y </line><line>CSS Grid</line>",
  "course:ui-dev-04-description": "Dada la relevancia que han cogido en los últimos tiempos, tanto Flexbox como Grid merecen un reservado donde ver todos sus entresijos y cómo pueden simplificar nuestras vidas.",
  "course:ui-dev-05-title": "<line>Ecosistema</line>",
  "course:ui-dev-05-description": "Si quieres introducirte en conceptos de maquetación avanzada es esencial conocer las herramientas de las que dispones, desde las posibilidades del editor hasta los trucos ocultos del navegador y la consola. Magia negra.",

  "course:front-description": "**Con este curso aprenderás**\nNo solo React, si no más importante: por qué React, cómo funciona, cuándo aplicarlo, patrones y antipatrones y en qué elementos del navegador se apoya. La versatilidad de React es muy amplia, como demuestran los proyectos de nuestro a día a día en Redradix. Y queremos contarte cómo lo hacemos.\n**Si te preguntas si es para ti...**\nEste es un curso avanzado para profesionales que han trabajado en desarrollo front al menos durante un año. Está centrado en *learn by doing* con ejercicios divertidos para hacer y corregir en vivo. *Live programming* al poder!",
  "course:front-01-title": "<line>Fundame</line><line>ntos</line>",
  "course:front-01-description": "Es necesario tener conocimiento de las posibilidades que ofrece el navegador: APIs, protocolos de comunicación, formularios o navegación. En verdad, solo así podremos construir algo verdaderamente escalable.",
  "course:front-02-title": "<line>Librerías y </line><line>frameworks</line>",
  "course:front-02-description": "Haremos una revisión del panorama de frameworks y librerías punteras, remarcando en que destaca cada una y cuando conviene utilizarla.",
  "course:front-03-title": "<line>React</line>",
  "course:front-03-description": "Nos centraremos en la librería que se ha ganado el derecho a ser el referente del desarrollo front. Profundizaremos en JSX, ciclo de vida, flujo unidireccional, renderizado condicional y tocaremos temas controvertidos como sus efectos secundarios o React Suspense.",
  "course:front-04-title": "<line>Módulos</line><line>opcionales</line>",
  "course:front-04-description": "Este curso tiene un montón de módulos opcionales con los que complementar una asignatura tan compleja como el desarrollo front. Alugunos relacionados con React como ReactRouter, ReactQuery o Redux, y otros más ¿GENERALES? Como testing en front, webextensions o i18n",

  "course:back-description": "**Con este curso aprenderás**\nEl 80% de los proyectos que hacemos en Redradix tienen APIs, programación asíncrona o persistencia de datos. Queremos contarte cómo lo hacemos aplicando Node.js, para que tú puedas aplicar estos conocimientos desde el primer día, creando servicios robustos y escalables de los que estar orgulloso.\n**Si te preguntas si es para ti...**\nEste es un curso avanzado para profesionales que han trabajado en *desarrollo back-end* al menos durante un año. Está centrado en *learn by doing* con ejercicios divertidos para hacer y corregir en vivo. *Live programming* al poder.",
  "course:back-01-title": "<line>Core</line><line>Modules</line>",
  "course:back-01-description": "Qué es Node y qué partes lo componen? Veremos módulos como Stream, CLI o Process, complejos pero necesarios para entender las tripas de este runtime tan querido por todos. Y esto nos servirá para sentar las bases para el resto del curso.",
  "course:back-02-title": "<line>HTTP y</line><line>HTTPS</line>",
  "course:back-02-description": "Desde cómo crear un servidor a cómo servir contenido a las bases de una buena API REST o el uso de proxies.",
  "course:back-03-title": "<line>Express</line>",
  "course:back-03-description": "Como framework de facto, debemos conocer sus patrones recurrentes y middlewares,  y sus estrategias de autenticación, haciendo hincapié en arquitecturas por capas.",
  "course:back-04-title": "<line>Programación</line><line>asíncrona</line>",
  "course:back-04-description": "Utilizaremos Koa como base para entender y ejercitar los conocimientos sobre promesas, async/await y generadores.",
  "course:back-05-title": "<line>Persistencia</line><line>de datos</line>",
  "course:back-05-description": "Relacionales, documentales, clave valor y también una ligera pincelada a las bases de datos de grafos para entender sus pros y contras. Y sobre todo cuándo es bueno utilizar cada una.",
  "course:back-06-title": "<line>Módulos</line><line>opcionales</line>",
  "course:back-06-description": "Podemos complementar con pequeños módulos de 4 horas sobre server side rendering, SMTP o, incluso, procesamiento y almacenamiento en la nube.",

  "course:objectives-title": "Objetivos",
  "course:fundamentals": "<line>Fundame</line><line>ntos</line>",
  "course:functional-programming": "<line>Program</line><line>ación </line><line>funciona</line><line>l</line>",
  "course:object-oriented-programming": "<line>Program</line><line>ación </line><line>orientad</line><line>a a</line><line>objetos</line>",
  "course:asynchronous-programming": "<line>Program</line><line>ación</line><line>asíncro</line><line>na</line>",
  "course:promises": "<line>Promesa</line><line>s</line>",
  "course:learn": "<lineAriaHidden>Con este/</lineAriaHidden><lineSROnly>Con este</lineSROnly> <line>curso</line> <line>aprenderás:</line>",
  "course:objectives": "<lineAriaHidden>Objetivos/</lineAriaHidden><lineSROnly>Objetivos /</lineSROnly> <line>público</line> <line>objetivo...?</line>",
  "course:euros": "<line>euros</line>",
  "course:hours": "<line>horas</line>",
  "course:places": "<line>plazas</line>",
  "course:practical": "<line>practical</line>",
  "course:students": " <line>alumnos</line> <line>inscritos</line>",
  "course:success": "<line>% de éxito</line>",
  "course:contact": "¿echas algo en falta? puedes combinar todo el temario de todos nuestros cursos como mejor se adapte a lo que BUSCAS",

  "custom:header": "Personaliza",
  "custom:title": "<line>Nuestros</line> <lineTabAriaHidden>cursos=</lineTabAriaHidden> <lineTabSROnly>cursos</lineTabSROnly> <lineTab>a tu</lineTab> <lineTab>medida</lineTab> <lineTabSROnly>¿Quieres saber cómo?</lineTabSROnly>",
  "custom:description": "Una misma formación, por muy buena que sea, no tiene porqué valerle a todo el mundo. Por eso con los cursos que hacemos en Classe es posible que te hagas un bundle con lo que más se adapte a ti.\nAdemás, para las empresas el temario se adapta dependiendo de lo que necesite el equipo que va a recibir la formación.\nY también somos flexibles con el formato, ya que todos nuestros cursos pueden ser presenciales en nuestra oficina - o en la tuya, si lo que quieres es un curso para empresas- o en remoto, pero en streaming. En directo para poder sacar el máximo partido de todos los que participan en la clase. Las preguntas en vivo, se responden mejor. Y nuestro equipo está dispuesto a hacer de patito de goma si en algún momento te hace falta.",
  "custom:claim": "<lineTab>¿Quieres</lineTab> <line>saber</line> <line>cómo?</line>",
  "custom:button": "Ver cursos",

  "featured:header": "Curso destacado",
  "featured:title": "<line>Full stack</line> <line>Program</line> <lineTab>(2021, 2022);</lineTab>",
  "featured:button": "¿Quieres saber más? Echa un ojo al curso",

  "facts:header": "Facts",
  "facts:title": "<line>Cuando decimos no</line> <lineTab>bullshit, es no bullshit</lineTab>",
  "facts:fact1": "Un programador motivado y bien preparado puede reducir hasta 10 veces el número de errores que comete.",
  "facts:fact2": "Éste es el único máster de desarrollo frontend orientado a profesionales con experiencia.",
  "facts:fact3": "No tenemos profesores. Solo profesionales que llevan años sacando todo tipo de proyectos. Y que saben lo que realmente importa en el día a día.",
  "facts:fact4": "Los desarrolladores senior ganan, de media, 30.000€ más que los junior.",
  "facts:fact5": "Un 60% de los alumnos han encontrado un puesto de trabajo mejor remunerado a los tres meses asistir a alguno de uno de nuestros cursos.",
  "facts:fact6": "Todos los cursos se basan en en JS porque creemos en la especialización y es el lenguaje que usamos nosotros.",

  "calendar:header": "Calendario",
  "calendar:title": "<line>Haz</line> <line>hueco</line> <lineTab>(en tu</lineTab> <lineTab>agenda)</lineTab>",
  "calendar:description": "Las clases se impartirán de lunes a viernes de 18:30h a 21:30h. Será en nuestras oficinas de la C/ Calatrava 27. Metro: La Latina, Puerta de Toledo o Tirso de Molina.\nTambién tenemos la opción de asistencia en remoto, o híbrida presencial+ online.",
  "calendar:start": "Start",
  "calendar:finish": "Finish",

  "companies:header": "Empresas",
  "companies:title": "<lineAriaHidden>#</lineAriaHidden><lineTab>Empresas</lineTab> <lineTab>que han</lineTab> <lineTab>vuelto a</lineTab> <lineTabAriaHidden>Class;e</lineTabAriaHidden><lineTabSROnly>Classe</lineTabSROnly> <lineAriaHidden>#</lineAriaHidden>",
  "companies:button": "¿Quieres ser una de ellas? contáctanos",

  "faqs:header": "Faq's",
  "faqs:title": "<lineAriaHidden>//Aprender es no parar</lineAriaHidden><lineSROnly>Aprender es no parar</lineSROnly> <lineTab>de preguntar</lineTab>",
  "faqs:faq1-title": "¿LLEVO POCO TIEMPO EN ESTO DEL DESARROLLO, ESTE CURSO ES PARA MÍ?",
  "faqs:faq1-description": "No creemos en los años de experiencia. Creemos en la pasión por la programación. Si tienes unas bases sólidas sobre las que podamos trabajar, entonces podemos hacer magia.",
  "faqs:faq2-title": "¿COMO CONVENZO A MI EMPRESA PARA QUE ORGANICE UNO DE LOS CURSOS?",
  "faqs:faq2-description": "Dile que nos contacte. Seguro que es consciente de en qué podéis mejorar. Y nosotros podemos explicarle cómo podéis hacerlo y cómo nuestros cursos se adaptan a las necesidades de cada empresa. También podemos hablar con él del resultado: menos errores en programación, menos dolores de cabeza y una mayor productividad.",
  "faqs:faq3-title": "¿HAY BENEFICIOS PARA LAS EMPRESAS CON VUESTROS CURSOS?",
  "faqs:faq3-description": "Sí. Tenemos acuerdos con la Fundación Tripartita, así que nuestros cursos se pueden financiera a través de ellos.",
  "faqs:faq4-title": "HE VISTO QUE TODA LA FORMACIÓN UTILIZA EL LENGUAJE JS, ¿POR QUÉ?",
  "faqs:faq4-description": "En nuestros cursos vamos a hablar de buenas prácticas, de principios de diseño, patrones, etc. Todo en un sentido práctico. Y para ello tenemos que utilizar un lenguaje real, el que usamos nosotros es JS. Es un lenguaje flexible y ejemplifica muy bien los paradigmas de la programación.",
  "faqs:faq5-title": "EN MI EMPRESA TRABAJAMOS CON OTROS LENGUAJES, ¿ME OLVIDO ENTONCES DE VUESTROS CURSOS?",
  "faqs:faq5-description": "Depende. Hay mucha gente que viene de otros lenguajes, y si quieres aprender JS este es tu curso, sin dudarlo. Además, tenemos los cursos de maqueta.",
  "faqs:faq6-title": "RECIBIRÉ ALGUNA TITULACIÓN AL TERMINAR EL CURSO?",
  "faqs:faq6-description": "Te daremos un certificado no homologado. En cambio sí que te llevaras muchos aprendizajes que te ayudarán a demostrar lo que vales sobre el terreno. Y eso nos parece más importante que un certificado oficial.",
  "faqs:faq7-title": "SI HAGO ALGUNO DE LOS CURSOS, ¿PUEDO ACCEDER LUEGO A LOS MATERIALES ONLINE?",
  "faqs:faq7-description": "Mejor aún. Si quieres podrás repetir las sesiones que te interese en las siguientes ediciones. Y además podrás acceder a los repositorios. Pero el nuestro es un curso en directo. Aunque en nuestro día a día defendemos la comunicación asíncrona, no se aprende igual si no se comparte el momento con el resto de la clase. ",
  "faqs:faq8-title": "¿NECESITO ALGÚN EQUIPO O PROGRAMA ESPECIAL?",
  "faqs:faq8-description": "Todo el mundo debe utilizar su ordenador porque es la forma de trabajar más a gusto. Nos da igual la herramienta que uses, con la que más cómodo estés. Más allá de eso proveemos de todo, incluidas chucherías para que tu cerebro funcione si haces el curso presencial en nuestra oficina.",
  "faqs:faq9-title": "¿CUÁLES SON LAS FORMAS DE PAGO? ¿EXISTE FINANCIACIÓN?",
  "faqs:faq9-description": "PENDIENTE",

  "find:header": "Encuéntranos",
  "find:title": "<line>Encuéntra</line> <line>nos en la</line> <lineTab>Latina</lineTab> <lineSROnly>y detrás pantalla</lineSROnly>",
  "find:description": "Si quieres venir a nuestras oficinas, estamos en pleno centro de Madrid, en la calle Calatrava, 27, al lado del Metro de La Latina.",
  "find:description2": "INFO<ariaHidden>[at]</ariaHidden><screenReader>@</screenReader>classe.dev",
  "find:claim": "<line>Y detrás</line> <lineTab>de la</lineTab> <lineTab>pantalla</lineTab>",
  "find:aria": "Copia nuestro email en el portapapeles",

  "contact:second-title": "<line>Contacta</line> <line>con Classe</line>",
  "contact:address1": "<line>Madrid, Calatrava 27</line> <line>[Metro La Latina]</line>",
  "contact:address2": "<lineAriaHidden>info[at]classe.dev</lineAriaHidden><lineSROnly>info@classe.dev</lineSROnly>",
  "contact:my-name-is": "<line>Ey! Me llamo</line>",
  "contact:interested-in": "<line>Estoy interesado en</line>",
  "contact:my-email": "<line>Y este es mi correo</line>",

  "footer:header": "Bye bye",
  "footer:title": "<line>Stay</line> <lineTab>in the</lineTab> <lineTab>know</lineTab>",
  "footer:iam": "Soy",
  "footer:company": "Empresa",
  "footer:student": "Alumno",
  "footer:social": "Social",
  "footer:contact": "Contacto",

  "error:page-not": "Page not",
  "error:found": "found",
  "error:back-to-homne": "Volver a la home",

  "konami:congrats": "¡Enhorabuena!",
  "konami:unlock-discount": "Has desbloqueado un descuento para los cursos.",
  "konami:use-it-1": "Para usarlo, deberás introducir tu nombre",
  "konami:use-it-2": "en el formulario de \"Contacta\" de la siguiente manera:",
  "konami:how-to": "%c[VIP] - tu_nombre",
  "konami:example": "Por ejemplo: %c[VIP] - Luke Skywalker"
}
